alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>													
			<field>													
				<name>NORELOAD_H</name>												
				<description>A 1 in this bit prevents the higher match and fractional match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit is not used when  the UNIFY bit is set.</description>												
				<bitRange>[8:8]</bitRange>												
											
			</field>													
			<field>													
				<name>INSYNC</name>												
				<description>Synchronization for input n (bit 9 = input 0, bit 10 = input 1,..., bit 16 = input 7). A 1 in one of these bits subjects the corresponding input to  synchronization to the SCT clock, before it is used to create an  event. If an input is synchronous to the SCT clock, keep its bit 0 for  faster response. When the CKMODE field is 1x, the bit in this field, corresponding  to the input selected by the CKSEL field, is not used.</description>												
				<bitRange>[16:9]</bitRange>												
											
			</field>													
			<field>													
				<name>AUTOLIMIT_L</name>												
				<description>A one in this bit causes a match on match register 0 to be treated  as a de-facto LIMIT condition without the need to define an  associated event. As with any LIMIT event, this automatic limit causes the  counter to be cleared to zero in uni-directional mode or to change  the direction of count in bi-directional mode. Software can write to set or clear this bit at any time. This bit  applies to both the higher and lower registers when the UNIFY bit  is set.</description>												
				<bitRange>[17:17]</bitRange>												
											
			</field>													
			<field>													
				<name>AUTOLIMIT_H</name>												
				<description>A one in this bit will cause a match on match register 0 to be treated  as a de-facto LIMIT condition without the need to define an  associated event. As with any LIMIT event, this automatic limit causes the  counter to be cleared to zero in uni-directional mode or to change  the direction of count in bi-directional mode. Software can write to set or clear this bit at any time. This bit is  not used when the UNIFY bit is set.</description>												
				<bitRange>[18:18]</bitRange>												
											
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[31:19]</bitRange>												
											
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>CTRL</name>														
		<description>SCT control register</description>														
		<addressOffset>0x004</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00040004</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>DOWN_L</name>												
				<description>This bit is 1 when the L or unified counter is counting down. Hardware sets this bit   when the counter limit is reached and BIDIR is 1. Hardware clears this bit when the counter reaches 0 or when the counter is counting down and a limit condition occurs.</description>												
				<bitRange>[0:0]</bitRange>												
											
			</field>													
			<field>													
				<name>STOP_L</name>												
				<description>When this bit is 1 and HALT is 0, the L or unified counter does not run but I/O  events related to the counter can occur. If such an event matches  the mask in the Start register, this bit is cleared and counting  resumes.</description>												
				<bitRange>[1:1]</bitRange>												
											
			</field>													
			<field>													
				<name>HALT_L</name>												
				<description>When this bit is 1, the L or unified counter does not run and no events can occur.  A reset sets this bit. When the HALT_L bit is one, the STOP_L bit is cleared. If you want to remove the halt condition and keep the SCT in the stop condition (not running), then you can change the halt and stop condition with one single write to this register. Once set, only software can clear this bit to restore counter operation.</description>												
				<bitRange>[2:2]</bitRange>												
											
			</field>													
			<field>													
				<name>CLRCTR_L</name>												
				<description>Writing a 1 to this bit clears the L or unified counter. This bit always reads as 0.</description>												
				<bitRange>[3:3]</bitRange>												
											
			</field>													
			<field>													
				<name>BIDIR_L</name>												
				<description>L or unified counter direction select</description>												
				<bitRange>[4:4]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>UP</name>										
						<description>Up. The counter counts up to its limit condition, then is cleared to zero.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>UPDOWN</name>										
						<description>Up-down. The counter counts up to its limit, then counts down to a limit condition or to 0.</description>								
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>PRE_L</name>												
				<description>Specifies the factor by which the SCT clock is prescaled to produce the  L or unified counter clock. The counter clock is clocked at the rate of the SCT  clock divided by PRE_L+1. Clear the counter (by writing a 1  to the CLRCTR bit) whenever changing the PRE value.</description>												
				<bitRange>[12:5]</bitRange>												
											
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[15:13]</bitRange>												
											
