alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
	<register>															
		<name>RES</name>														
		<description>SCT conflict resolution register</description>														
		<addressOffset>0x058</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>O0RES</name>												
				<description>Effect of simultaneous set and clear on output 0.</description>												
				<bitRange>[1:0]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR0 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR0 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O1RES</name>												
				<description>Effect of simultaneous set and clear on output 1.</description>												
				<bitRange>[3:2]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR1 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR1 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O2RES</name>												
				<description>Effect of simultaneous set and clear on output 2.</description>												
				<bitRange>[5:4]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR2 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_N_OR_S</name>										
						<description>Clear output n (or set based on the SETCLR2 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O3RES</name>												
				<description>Effect of simultaneous set and clear on output 3.</description>												
				<bitRange>[7:6]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR3 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR3 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O4RES</name>												
				<description>Effect of simultaneous set and clear on output 4.</description>												
				<bitRange>[9:8]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR4 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR4 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O5RES</name>												
				<description>Effect of simultaneous set and clear on output 5.</description>												
				<bitRange>[11:10]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR5 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR5 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O6RES</name>												
				<description>Effect of simultaneous set and clear on output 6.</description>												
				<bitRange>[13:12]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR6 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR6 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O7RES</name>												
				<description>Effect of simultaneous set and clear on output 7.</description>												
				<bitRange>[15:14]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR7 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR7 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O8RES</name>												
				<description>Effect of simultaneous set and clear on output 8.</description>												
				<bitRange>[17:16]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR8 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR8 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O9RES</name>												
				<description>Effect of simultaneous set and clear on output 9.</description>												
				<bitRange>[19:18]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR9 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR9 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O10RES</name>												
				<description>Effect of simultaneous set and clear on output 10.</description>												
				<bitRange>[21:20]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR10 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR10 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O11RES</name>												
				<description>Effect of simultaneous set and clear on output 11.</description>												
				<bitRange>[23:22]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR11 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR11 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O12RES</name>												
				<description>Effect of simultaneous set and clear on output 12.</description>												
				<bitRange>[25:24]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR12 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR12 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O13RES</name>												
				<description>Effect of simultaneous set and clear on output 13.</description>												
				<bitRange>[27:26]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR13 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR13 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O14RES</name>												
				<description>Effect of simultaneous set and clear on output 14.</description>												
				<bitRange>[29:28]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR14 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR14 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>O15RES</name>												
				<description>Effect of simultaneous set and clear on output 15.</description>												
				<bitRange>[31:30]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>NO_CHANGE</name>										
						<description>No change.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SET_OUTPUT_OR_CLEAR</name>										
						<description>Set output (or clear based on the SETCLR15 field).</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>CLEAR_OUTPUT_OR_SET</name>										
						<description>Clear output (or set based on the SETCLR15 field).</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>TOGGLE_OUTPUT</name>										
						<description>Toggle output.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
		</fields>														
	</register>															
