alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>													
			<field>													
				<name>DIRECTION</name>												
				<description>Direction qualifier for event generation. This field only applies when the counters are operating in BIDIR  mode. If BIDIR = 0, the SCT ignores this field. Value 0x3 is reserved.</description>												
				<bitRange>[22:21]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>DIRECTION_INDEPENDEN</name>										
						<description>Direction independent. This event is triggered regardless of the count direction.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>COUNTING_UP</name>										
						<description>Counting up. This event is triggered only during up-counting when BIDIR = 1.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>COUNTING_DOWN</name>										
						<description>Counting down. This event is triggered only during down-counting when BIDIR = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[31:23]</bitRange>												
											
			</field>													
		</fields>														
	</register>															
	<register>															
		<dim>16</dim>														
		<dimIncrement>0x8</dimIncrement>														
		<dimIndex>0-15</dimIndex>														
		<name>OUT%s_SET</name>														
		<description>SCT output 0 set register</description>														
		<addressOffset>0x500</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>SET0</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[0:0]</bitRange>												
			</field>													
			<field>													
				<name>SET1</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[1:1]</bitRange>												
			</field>													
			<field>													
				<name>SET2</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[2:2]</bitRange>												
			</field>													
			<field>													
				<name>SET3</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[3:3]</bitRange>												
			</field>													
			<field>													
				<name>SET4</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[4:4]</bitRange>												
			</field>													
			<field>													
				<name>SET5</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[5:5]</bitRange>												
			</field>													
			<field>													
				<name>SET6</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[6:6]</bitRange>												
			</field>													
			<field>													
				<name>SET7</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[7:7]</bitRange>												
			</field>													
			<field>													
				<name>SET8</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[8:8]</bitRange>												
			</field>													
			<field>													
				<name>SET9</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[9:9]</bitRange>												
			</field>													
			<field>													
				<name>SET10</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[10:10]</bitRange>												
			</field>													
			<field>													
				<name>SET11</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[11:11]</bitRange>												
			</field>													
			<field>													
				<name>SET12</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[12:12]</bitRange>												
			</field>													
			<field>													
				<name>SET13</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[13:13]</bitRange>												
			</field>													
			<field>													
				<name>SET14</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[14:14]</bitRange>												
			</field>													
			<field>													
				<name>SET15</name>												
				<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[15:15]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<dim>16</dim>														
		<dimIncrement>0x8</dimIncrement>														
		<dimIndex>0-15</dimIndex>														
		<name>OUT%s_CLR</name>														
		<description>SCT output 0 clear register</description>														
		<addressOffset>0x504</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>CLR0</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[0:0]</bitRange>												
			</field>													
			<field>													
				<name>CLR1</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[1:1]</bitRange>												
			</field>													
			<field>													
				<name>CLR2</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[2:2]</bitRange>												
			</field>													
			<field>													
				<name>CLR3</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[3:3]</bitRange>												
			</field>													
			<field>													
				<name>CLR4</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[4:4]</bitRange>												
			</field>													
			<field>													
				<name>CLR5</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[5:5]</bitRange>												
			</field>													
			<field>													
				<name>CLR6</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[6:6]</bitRange>												
			</field>													
			<field>													
				<name>CLR7</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[7:7]</bitRange>												
			</field>													
			<field>													
				<name>CLR8</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[8:8]</bitRange>												
			</field>													
			<field>													
				<name>CLR9</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[9:9]</bitRange>												
			</field>													
			<field>													
				<name>CLR10</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[10:10]</bitRange>												
			</field>													
			<field>													
				<name>CLR11</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[11:11]</bitRange>												
			</field>													
			<field>													
				<name>CLR12</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[12:12]</bitRange>												
			</field>													
			<field>													
				<name>CLR13</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[13:13]</bitRange>												
			</field>													
			<field>													
				<name>CLR14</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[14:14]</bitRange>												
			</field>													
			<field>													
				<name>CLR15</name>												
				<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>												
				<bitRange>[15:15]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
