alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
				</field>
			</fields>
		</register>
		<register>
			<name>CMD</name>
			<description>SPIFI command register</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATALEN</name>
					<description>Except when the POLL bit in this register is 1, this field controls how many data bytes are in the command. 0 indicates that the command does not contain a data field.</description>
					<bitRange>[13:0]</bitRange>

				</field>
				<field>
					<name>POLL</name>
					<description>This bit should be written as 1 only with an opcode that a) contains an input data field, and b) causes the serial flash device to return byte status repetitively (e.g., a Read Status command). When this bit is 1, the SPIFI hardware continues to read bytes until the test specified by the dataLen field is met. The hardware tests the bit in each status byte selected by DATALEN bits 2:0, until a bit is found that is equal to DATALEN bit 3. When the test succeeds, the SPIFI captures the byte that meets this test so that it can be read from the Data Register, and terminates the command by raising  CS. The end-of-command interrupt can be enabled to inform software when this occurs</description>
					<bitRange>[14:14]</bitRange>

				</field>
				<field>
					<name>DOUT</name>
					<description>If the DATALEN field is not zero, this bit controls the direction of the data:</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_FROM_SERIAL_FL</name>
							<description>Input from serial flash.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTPUT_TO_SERIAL_FLA</name>
							<description>Output to serial flash.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INTLEN</name>
					<description>This field controls how many intermediate bytes precede the data. (Each such byte may require 8 or 2 SCK cycles, depending on whether the intermediate field is in serial, 2-bit, or 4-bit format.) Intermediate bytes are output by the SPIFI, and include post-address control information, dummy and delay bytes. See the description of the Intermediate Data register for the contents of such bytes.</description>
					<bitRange>[18:16]</bitRange>

				</field>
				<field>
					<name>FIELDFORM</name>
					<description>This field controls how the fields of the command are sent.</description>
					<bitRange>[20:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ALL_SERIAL</name>
							<description>All serial. All fields of the command are serial.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>QUADDUAL_DATA</name>
							<description>Quad/dual data. Data field is quad/dual, other fields are serial.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SERIAL_OPCODE</name>
							<description>Serial opcode. Opcode field is serial. Other fields are quad/dual.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ALL_QUADDUAL</name>
							<description>All quad/dual. All fields of the command are in quad/dual format.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FRAMEFORM</name>
					<description>This field controls the opcode and address fields.</description>
					<bitRange>[23:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<isDefault>true</isDefault>
							
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE</name>
							<description>Opcode. Opcode only, no address.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE_ONE_BYTE</name>
							<description>Opcode one byte. Opcode, least significant byte of address.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE_TWO_BYTES</name>
							<description>Opcode two bytes. Opcode, two least significant bytes of address.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE_THREE_BYTES</name>
							<description>Opcode three bytes. Opcode, three least significant bytes of address.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE_FOUR_BYTES</name>
							<description>Opcode four bytes. Opcode, 4 bytes of address.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>NO_OPCODE_THREE_BYTE</name>
							<description>No opcode three bytes. No opcode, 3 least significant bytes of address.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>NO_OPCODE_FOUR_BYTES</name>
							<description>No opcode four bytes. No opcode, 4 bytes of address.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>OPCODE</name>
					<description>The opcode of the command (not used for some FRAMEFORM values).</description>
					<bitRange>[31:24]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>ADDR</name>
			<description>SPIFI address register</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ADDRESS</name>
					<description>Address.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IDATA</name>
			<description>SPIFI intermediate data register</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IDATA</name>
					<description>Value of intermediate bytes.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLIMIT</name>
			<description>SPIFI cache limit register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0x08000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLIMIT</name>
					<description>Zero-based upper limit of cacheable memory</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DATA</name>
			<description>SPIFI data register</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA</name>
					<description>Input or output data</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MCMD</name>
			<description>SPIFI memory command register</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[13:0]</bitRange>

