alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>					
			<field>					
				<name>UPDATE_CLOCK_REGISTERS_ONLY</name>				
				<description>Update clock registers only. Following register values transferred into card clock domain: CLKDIV, CLRSRC, CLKENA. Changes card clocks (change frequency, truncate off or on, and set low-frequency mode); provided in order to change clock frequency or stop clock without having to send command to cards. During normal command sequence, when update_clock_registers_only = 0, following control registers are transferred from BIU to CIU: CMD, CMDARG, TMOUT, CTYPE, BLKSIZ, BYTCNT. CIU uses new register values for new command sequence to card(s). When bit is set, there are no Command Done interrupts because no command is sent to SD_MMC_CEATA cards.</description>				
				<bitRange>[21:21]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NORMAL</name>		
						<description>Normal. Normal command sequence</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>NO</name>		
						<description>No. Do not send commands, just update clock register value into card clock domain</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>READ_CEATA_DEVICE</name>				
				<description>Read ceata device. Software should set this bit to indicate that CE-ATA device is being accessed for read transfer. This bit is used to disable read data time-out indication while performing CE-ATA read transfers. Maximum value of I/O transmission delay can be no less than 10 seconds.The SD/MMC interface should not indicate read data time-out while waiting for data from CE-ATA device.</description>				
				<bitRange>[22:22]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NO_READ</name>		
						<description>No read. Host is not performing read access (RW_REG or RW_BLK) towards CE-ATA device.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>READ</name>		
						<description>Read. Host is performing read access (RW_REG or RW_BLK) towards CE-ATA device.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>CCS_EXPECTED</name>				
				<description>CCS expected. If the command expects Command Completion Signal (CCS) from the CE-ATA device, the software should set this control bit. The SD/MMC controller sets the Data Transfer Over (DTO) bit in the RINTSTS register and generates an interrupt to the host if the Data Transfer Over interrupt is not masked.</description>				
				<bitRange>[23:23]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DISABLED</name>		
						<description>Disabled. Interrupts are not enabled in CE-ATA device (nIEN = 1 in ATA control register), or command does not expect CCS from device.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ENABLED</name>		
						<description>Enabled. Interrupts are enabled in CE-ATA device (nIEN = 0), and RW_BLK command expects command completion signal from CE-ATA device.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ENABLE_BOOT</name>				
				<description>Enable Boot - this bit should be set only for mandatory boot mode. When Software sets this bit along with start_cmd, CIU starts the boot sequence for the corresponding card by asserting the CMD line low. Do NOT set disable_boot and enable_boot together.</description>				
				<bitRange>[24:24]</bitRange>				
			
			</field>					
			<field>					
				<name>EXPECT_BOOT_ACK</name>				
				<description>Expect Boot Acknowledge. When Software sets this bit along with enable_boot, CIU expects a boot acknowledge start pattern of 0-1-0 from the selected card.</description>				
				<bitRange>[25:25]</bitRange>				
			
			</field>					
			<field>					
				<name>DISABLE_BOOT</name>				
				<description>Disable Boot. When software sets this bit along with start_cmd, CIU terminates the boot operation. Do NOT set disable_boot and enable_boot together.</description>				
				<bitRange>[26:26]</bitRange>				
			
			</field>					
			<field>					
				<name>BOOT_MODE</name>				
				<description>Boot Mode</description>				
				<bitRange>[27:27]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>MANDATORY_BOOT_OPERA</name>		
						<description>Mandatory Boot operation</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ALTERNATE_BOOT_OPERA</name>		
						<description>Alternate Boot operation</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>VOLT_SWITCH</name>				
				<description>Voltage switch bit</description>				
				<bitRange>[28:28]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DISABLED</name>		
						<description>Disabled. No voltage switching</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ENABLED</name>		
						<description>Enabled. Voltage switching enabled; must be set for CMD11 only</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[30:29]</bitRange>				
			
			</field>					
			<field>					
				<name>START_CMD</name>				
				<description>Start command. Once command is taken by CIU, this bit is cleared. When bit is set, host should not attempt to write to any command registers. If write is attempted, hardware lock error is set in raw interrupt register. Once command is sent and response is received from SD_MMC_CEATA cards, Command Done bit is set in the raw interrupt register.</description>				
				<bitRange>[31:31]</bitRange>				
			
