alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICRP</name>					
		<description>Selects the precharge command period.</description>					
		<addressOffset>0x030</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TRP</name>			
				<description>Precharge command period. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICRAS</name>					
		<description>Selects the active to precharge command period.</description>					
		<addressOffset>0x034</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TRAS</name>			
				<description>Active to precharge command period. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICSREX</name>					
		<description>Selects the self-refresh exit time.</description>					
		<addressOffset>0x038</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TSREX</name>			
				<description>Self-refresh exit time. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICAPR</name>					
		<description>Selects the last-data-out to active command time.</description>					
		<addressOffset>0x03C</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TAPR</name>			
				<description>Last-data-out to active command time. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICDAL</name>					
		<description>Selects the data-in to active command time.</description>					
		<addressOffset>0x040</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TDAL</name>			
				<description>Data-in to active command. 0x0 - 0xE = n clock cycles. The delay is in EMC_CCLK cycles. 0xF = 15 clock cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICWR</name>					
		<description>Selects the write recovery time.</description>					
		<addressOffset>0x044</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TWR</name>			
				<description>Write recovery time. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICRC</name>					
		<description>Selects the active to active command period.</description>					
		<addressOffset>0x048</addressOffset>					
		<access>read-write</access>					
		<resetValue>0x1F</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TRC</name>			
				<description>Active to active command period. 0x0 - 0x1E = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>			
				<bitRange>[4:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:5]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICRFC</name>					
		<description>Selects the auto-refresh period.</description>					
		<addressOffset>0x04C</addressOffset>					
		<access>read-write</access>					
		<resetValue>0x1F</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TRFC</name>			
				<description>Auto-refresh period and auto-refresh to active command period. 0x0 - 0x1E = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>			
				<bitRange>[4:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:5]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICXSR</name>					
		<description>Selects the exit self-refresh to active command time.</description>					
		<addressOffset>0x050</addressOffset>					
		<access>read-write</access>					
		<resetValue>0x1F</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TXSR</name>			
				<description>Exit self-refresh to active command time. 0x0 - 0x1E = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0x1F = 32 clock cycles (POR reset value).</description>			
				<bitRange>[4:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:5]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICRRD</name>					
		<description>Selects the active bank A to active bank B latency.</description>					
		<addressOffset>0x054</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TRRD</name>			
				<description>Active bank A to active bank B latency 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>DYNAMICMRD</name>					
		<description>Selects the load mode register to active command time.</description>					
		<addressOffset>0x058</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>TMRD</name>			
				<description>Load mode register to active command time. 0x0 - 0xE = n + 1 clock cycles. The delay is in EMC_CCLK cycles. 0xF = 16 clock cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<name>STATICEXTENDEDWAIT</name>					
		<description>Selects time for long static memory read and write transfers.</description>					
		<addressOffset>0x080</addressOffset>					
		<access>read-write</access>					
		<resetValue>0</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>EXTENDEDWAIT</name>			
				<description>Extended wait time out. 16 clock cycles (POR reset value). The delay is in EMC_CCLK cycles. 0x0 = 16 clock cycles. 0x1 - 0x3FF = (n+1) x16 clock cycles.</description>			
				<bitRange>[9:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:10]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<dim>4</dim>					
		<dimIncrement>0x20</dimIncrement>					
		<dimIndex>0-3</dimIndex>					
		<name>DYNAMICCONFIG%s</name>					
		<description>Selects the configuration information for dynamic memory chip select 0.</description>					
		<addressOffset>0x100</addressOffset>					
		<access>read-write</access>					
		<resetValue>0</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[2:0]</bitRange>			
		
