alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>				
		</fields>					
	</register>						
	<register>						
		<dim>4</dim>					
		<dimIncrement>0x20</dimIncrement>					
		<dimIndex>0-3</dimIndex>					
		<name>STATICWAITWEN%s</name>					
		<description>Selects the delay from chip select 0 to write enable.</description>					
		<addressOffset>0x204</addressOffset>					
		<access>read-write</access>					
		<resetValue>0</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>WAITWEN</name>			
				<description>Wait write enable. Delay from chip select assertion to write enable. 0x0 = One EMC_CCLK cycle delay between assertion of chip select and write enable (POR reset value). 0x1 - 0xF = (n + 1) EMC_CCLK cycle delay. The delay is (WAITWEN +1) x tEMC_CCLK.</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<dim>4</dim>					
		<dimIncrement>0x20</dimIncrement>					
		<dimIndex>0-3</dimIndex>					
		<name>STATICWAITOEN%s</name>					
		<description>Selects the delay from chip select 0 or address change, whichever is later, to output enable.</description>					
		<addressOffset>0x208</addressOffset>					
		<access>read-write</access>					
		<resetValue>0</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>WAITOEN</name>			
				<description>Wait output enable. Delay from chip select assertion to output enable. 0x0 = No delay (POR reset value). 0x1 - 0xF = n cycle delay. The delay is WAITOEN x tEMC_CCLK.</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<dim>4</dim>					
		<dimIncrement>0x20</dimIncrement>					
		<dimIndex>0-3</dimIndex>					
		<name>STATICWAITRD%s</name>					
		<description>Selects the delay from chip select 0 to a read access.</description>					
		<addressOffset>0x20C</addressOffset>					
		<access>read-write</access>					
		<resetValue>0x1F</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>WAITRD</name>			
				<description>Non-page mode read wait states or asynchronous page mode read first access wait state. Non-page mode read or asynchronous page mode read, first read only: 0x0 - 0x1E = (n + 1) EMC_CCLK cycles for read accesses. For non-sequential reads, the wait state time is (WAITRD + 1) x tEMC_CCLK. 0x1F = 32 EMC_CCLK cycles for read accesses (POR reset value).</description>			
				<bitRange>[4:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:5]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<dim>4</dim>					
		<dimIncrement>0x20</dimIncrement>					
		<dimIndex>0-3</dimIndex>					
		<name>STATICWAITPAGE%s</name>					
		<description>Selects the delay for asynchronous page mode sequential accesses for chip select 0.</description>					
		<addressOffset>0x210</addressOffset>					
		<access>read-write</access>					
		<resetValue>0x1F</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>WAITPAGE</name>			
				<description>Asynchronous page mode read after the first read wait states. Number of wait states for asynchronous page mode read accesses after the first read: 0x0 - 0x1E = (n+ 1) EMC_CCLK cycle read access time. For asynchronous page mode read for sequential reads, the wait state time for page mode accesses after the first read is (WAITPAGE + 1) x tEMC_CCLK. 0x1F = 32 EMC_CCLK cycle read access time (POR reset value).</description>			
				<bitRange>[4:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:5]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<dim>4</dim>					
		<dimIncrement>0x20</dimIncrement>					
		<dimIndex>0-3</dimIndex>					
		<name>STATICWAITWR%s</name>					
		<description>Selects the delay from chip select 0 to a write access.</description>					
		<addressOffset>0x214</addressOffset>					
		<access>read-write</access>					
		<resetValue>0x1F</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>WAITWR</name>			
				<description>Write wait states. SRAM wait state time for write accesses after the first read: 0x0 - 0x1E = (n + 2) EMC_CCLK cycle write access time. The wait state time for write accesses after the first read is WAITWR (n + 2) x tEMC_CCLK. 0x1F = 33 EMC_CCLK cycle write access time (POR reset value).</description>			
				<bitRange>[4:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:5]</bitRange>			
			</field>				
		</fields>					
	</register>						
	<register>						
		<dim>4</dim>					
		<dimIncrement>0x20</dimIncrement>					
		<dimIndex>0-3</dimIndex>					
		<name>STATICWAITTURN%s</name>					
		<description>Selects the number of bus turnaround cycles for chip select 0.</description>					
		<addressOffset>0x218</addressOffset>					
		<access>read-write</access>					
		<resetValue>0xF</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>WAITTURN</name>			
				<description>Bus turnaround cycles. 0x0 - 0xE = (n + 1) EMC_CCLK turnaround cycles. Bus turnaround time is (WAITTURN + 1) x tEMC_CCLK. 0xF = 16 EMC_CCLK turnaround cycles (POR reset value).</description>			
				<bitRange>[3:0]</bitRange>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:4]</bitRange>			
			</field>				
		</fields>					
	</register>						
