alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
				<register>
					<name>CRSR_INTMSK</name>
					<description>Cursor Interrupt Mask register</description>
					<addressOffset>0xC20</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRIM</name>
							<description>Cursor interrupt mask. When clear, the cursor never interrupts the processor. When set, the cursor interrupts the processor immediately after reading of the last word of cursor image.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_INTCLR</name>
					<description>Cursor Interrupt Clear register</description>
					<addressOffset>0xC24</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRIC</name>
							<description>Cursor interrupt clear. Writing a 0 to this bit has no effect. Writing a 1 to this bit causes the cursor interrupt status to be cleared.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_INTRAW</name>
					<description>Cursor Raw Interrupt Status register</description>
					<addressOffset>0xC28</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRRIS</name>
							<description>Cursor raw interrupt status. The cursor interrupt status is set immediately after the last data is read from the cursor image for the current frame. This bit is cleared by writing to the CrsrIC bit in the CRSR_INTCLR register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_INTSTAT</name>
					<description>Cursor Masked Interrupt Status register</description>
					<addressOffset>0xC2C</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRMIS</name>
							<description>Cursor masked interrupt status. The cursor interrupt status is set immediately after the last data read from the cursor image for the current frame, providing that the corresponding bit in the CRSR_INTMSK register is set. The bit remains clear if the CRSR_INTMSK register is clear. This bit is cleared by writing to the CRSR_INTCLR register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
		<peripheral>
			<name>EEPROM</name>
			<description>EEPROM</description>
			<groupName>EEPROM</groupName>
			<baseAddress>0x4000E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FLASH</name>
				<value>4</value>
			</interrupt>
			<registers>														
				<register>													
					<name>CMD</name>												
					<description>EEPROM command register</description>												
					<addressOffset>0x000</addressOffset>												
					<access>read-write</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>CMD</name>										
							<description>Command. Read data shows the last command executed on the EEPROM. 110 = erase/program page All other values are reserved.</description>										
							<bitRange>[2:0]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:3]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>RWSTATE</name>												
					<description>EEPROM read wait state register</description>												
					<addressOffset>0x008</addressOffset>												
					<access>read-write</access>												
					<resetValue>0x00000905</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>RPHASE2</name>										
							<description>Wait states 2 (minus 1 encoded). The number of system clock periods to meet the read operations TRPHASE2 duration.</description>										
							<bitRange>[7:0]</bitRange>										
						</field>											
						<field>											
							<name>RPHASE1</name>										
							<description>Wait states 1 (minus 1 encoded). The number of system clock periods to meet a duration equal to TRPHASE1.</description>										
							<bitRange>[15:8]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:16]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>AUTOPROG</name>												
					<description>EEPROM auto programming register</description>												
					<addressOffset>0x00C</addressOffset>												
					<access>read-write</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>AUTOPROG</name>										
							<description>Auto programming mode: 00 = auto programming off 01 = erase/program cycle is triggered after 1 word is written 10 = erase/program cycle is triggered after a write to AHB address ending with  ......1111100 (last word of a page)</description>										
							<bitRange>[1:0]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:2]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>WSTATE</name>												
					<description>EEPROM wait state register</description>												
					<addressOffset>0x010</addressOffset>												
					<access>read-write</access>												
					<resetValue>0x00020602</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>PHASE3</name>										
							<description>Wait states for phase 3 (minus 1 encoded). The number of system clock periods to meet a duration equal to TPHASE3.</description>										
							<bitRange>[7:0]</bitRange>										
						</field>											
						<field>											
							<name>PHASE2</name>										
							<description>Wait states for phase 2 (minus 1 encoded). The number of system clock periods to meet a duration equal to TPHASE2.</description>										
							<bitRange>[15:8]</bitRange>										
						</field>											
						<field>											
							<name>PHASE1</name>										
							<description>Wait states for phase 1 (minus 1 encoded). The number of system clock periods to meet a duration equal to TPHASE1.</description>										
							<bitRange>[23:16]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[30:24]</bitRange>										
						</field>											
						<field>											
							<name>LCK_PARWEP</name>										
							<description>Lock timing parameters for write, erase and program operation  0 = WSTATE and CLKDIV registers have R/W access  1 = WSTATE and CLKDIV registers have R only access</description>										
							<bitRange>[31:31]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>CLKDIV</name>												
					<description>EEPROM clock divider register</description>												
					<addressOffset>0x014</addressOffset>												
					<access>read-write</access>												
					<resetValue>0x00000063</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>CLKDIV</name>										
							<description>Division factor (minus 1 encoded).</description>										
							<bitRange>[15:0]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:16]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>PWRDWN</name>												
					<description>EEPROM power-down register</description>												
					<addressOffset>0x018</addressOffset>												
					<access>read-write</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>PWRDWN</name>										
							<description>Power down mode bit. 0 = not in power down mode. 1 = power down mode.</description>										
							<bitRange>[0:0]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:1]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>INTENCLR</name>												
					<description>EEPROM interrupt enable clear</description>												
					<addressOffset>0xFD8</addressOffset>												
					<access>write-only</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[1:0]</bitRange>										
						</field>											
						<field>											
							<name>PROG_CLR_EN</name>										
							<description>Clear program operation finished interrupt enable bit for EEPROM. 0 = leave corresponding bit unchanged. 1 = clear corresponding bit.</description>										
							<bitRange>[2:2]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:3]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>INTENSET</name>												
					<description>EEPROM interrupt enable set</description>												
					<addressOffset>0xFDC</addressOffset>												
					<access>write-only</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[1:0]</bitRange>										
						</field>											
						<field>											
							<name>PROG_SET_EN</name>										
							<description>Set program operation finished interrupt enable bit for EEPROM device 1. 0 = leave corresponding bit unchanged. 1 = set corresponding bit.</description>										
							<bitRange>[2:2]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:3]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>INTSTAT</name>												
					<description>EEPROM interrupt status</description>												
					<addressOffset>0xFE0</addressOffset>												
					<access>read-only</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. The value read from a reserved bit is not defined.</description>										
							<bitRange>[1:0]</bitRange>										
						</field>											
						<field>											
							<name>END_OF_PROG</name>										
							<description>EEPROM program operation finished interrupt status bit. Bit is: - set when this operation has finished OR when one is written to the corresponding bit of the INTSTATSET register. - cleared when one is written to the corresponding bit of the INTSTATCLR register.</description>										
							<bitRange>[2:2]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. The value read from a reserved bit is not defined.</description>										
							<bitRange>[31:3]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>INTEN</name>												
					<description>EEPROM interrupt enable</description>												
					<addressOffset>0xFE4</addressOffset>												
					<access>write-only</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. The value read from a reserved bit is not defined.</description>										
							<bitRange>[1:0]</bitRange>										
						</field>											
						<field>											
							<name>EE_PROG_DONE</name>										
							<description>EEPROM program operation finished interrupt enable bit. Bit is: - set when one is written in the corresponding bit of the INTENSET register. - cleared when one is written to the corresponding bit of the INTENCLR register.</description>										
							<bitRange>[2:2]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. The value read from a reserved bit is not defined.</description>										
							<bitRange>[31:3]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>INTSTATCLR</name>												
					<description>EEPROM interrupt status clear</description>												
					<addressOffset>0xFE8</addressOffset>												
					<access>write-only</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[1:0]</bitRange>										
						</field>											
						<field>											
							<name>PROG_CLR_ST</name>										
							<description>Clear program operation finished interrupt status bit for EEPROM device. 0 = leave corresponding bit unchanged. 1 = clear corresponding bit.</description>										
							<bitRange>[2:2]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:3]</bitRange>										
						</field>											
					</fields>												
				</register>													
				<register>													
					<name>INTSTATSET</name>												
					<description>EEPROM interrupt status set</description>												
					<addressOffset>0xFEC</addressOffset>												
					<access>write-only</access>												
					<resetValue>0</resetValue>												
					<resetMask>0xFFFFFFFF</resetMask>												
					<fields>												
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[1:0]</bitRange>										
						</field>											
						<field>											
							<name>PROG_SET_ST</name>										
							<description>Set program operation finished interrupt status bit for EEPROM device. 0 = leave corresponding bit unchanged. 1 = set corresponding bit.</description>										
							<bitRange>[2:2]</bitRange>										
						</field>											
						<field>											
							<name>RESERVED</name>										
							<description>Reserved. Read value is undefined, only zero should be written.</description>										
							<bitRange>[31:3]</bitRange>										
						</field>											
					</fields>												
				</register>													
