alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>										
			<field>										
				<name>RESET_L</name>									
				<description>Level detect mode for Reset</description>									
				<bitRange>[19:19]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL_IF</name>							
						<description>Detect LOW level if bit 17 in the EDGE register is 0. Detect falling edge if bit 17 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL_IF</name>							
						<description>Detect HIGH level if bit 17 in the EDGE register is 0. Detect rising edge if bit 17 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>BODRESET_L</name>									
				<description>Level detect mode for BOD Reset</description>									
				<bitRange>[20:20]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL_IF</name>							
						<description>Detect LOW level if bit 20 in the EDGE register is 0. Detect falling edge if bit 20 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL_IF</name>							
						<description>Detect HIGH level if bit 20 in the EDGE register is 0. Detect rising edge if bit 20 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>DPDRESET_L</name>									
				<description>Level detect mode for Deep power-down Reset</description>									
				<bitRange>[21:21]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL_IF</name>							
						<description>Detect LOW level if bit 21 in the EDGE register is 0. Detect falling edge if bit 21 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL_IF</name>							
						<description>Detect HIGH level if bit 21 in the EDGE register is 0. Detect rising edge if bit 21 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[31:22]</bitRange>									
								
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>EDGE</name>											
		<description>Edge configuration</description>											
		<addressOffset>0x004</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x000</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>WAKEUP0_E</name>									
				<description>Edge detect mode for WAKEUP0 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[0:0]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_WAKEU</name>							
						<description>Edge detect of WAKEUP0 pin. Detect falling edge if bit 0 in the HILO register is 0. Detect rising edge if bit 0 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>WAKEUP1_E</name>									
				<description>Edge/level detect mode for WAKEUP1 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[1:1]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_WAKEU</name>							
						<description>Edge detect of WAKEUP1 pin. Detect falling edge if bit 1 in the HILO register is 0. Detect rising edge if bit 1 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>WAKEUP2_E</name>									
				<description>Edge/level detect mode for WAKEUP2 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[2:2]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_WAKEU</name>							
						<description>Edge detect of WAKEUP2 pin. Detect falling edge if bit 2 in the HILO register is 0. Detect rising edge if bit 2 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>WAKEUP3_E</name>									
				<description>Edge/level detect mode for WAKEUP3 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[3:3]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_WAKEU</name>							
						<description>Edge detect of WAKEUP3 pin. Detect falling edge if bit 30 in the HILO register is 0. Detect rising edge if bit 3 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>ATIMER_E</name>									
				<description>Edge/level detect mode for alarm timer event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[4:4]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_A</name>							
						<description>Edge detect of the alarm timer interrupt. Detect falling edge if bit 4 in the HILO register is 0. Detect rising edge if bit 4 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RTC_E</name>									
				<description>Edge/level detect mode for RTC event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[5:5]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_R</name>							
						<description>Edge detect of the RTC interrupt. Detect falling edge if bit 5 in the HILO register is 0. Detect rising edge if bit 5 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>BOD_E</name>									
				<description>Edge/level detect mode for BOD event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[6:6]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_B</name>							
						<description>Edge detect of the BOD interrupt. Detect falling edge if bit 6 in the HILO register is 0. Detect rising edge if bit 6 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>WWDT_E</name>									
				<description>Edge/level detect mode for WWDTD event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[7:7]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_W</name>							
						<description>Edge detect of the WWDT interrupt. Detect falling edge if bit 7 in the HILO register is 0. Detect rising edge if bit 7 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>ETH_E</name>									
				<description>Edge/level detect mode for ethernet event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[8:8]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_E</name>							
						<description>Edge detect of the Ethernet interrupt. Detect falling edge if bit 8 in the HILO register is 0. Detect rising edge if bit 8 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>USB0_E</name>									
				<description>Edge/level detect mode for USB0 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[9:9]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_U</name>							
						<description>Edge detect of the USB0 event. Detect falling edge if bit 9 in the HILO register is 0. Detect rising edge if bit 9 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>USB1_E</name>									
				<description>Edge/level detect mode for USB1 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[10:10]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_U</name>							
						<description>Edge detect of the USB1 interrupt. Detect falling edge if bit 10 in the HILO register is 0. Detect rising edge if bit 10 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>SDMMC_E</name>									
				<description>Edge/level detect mode for SD/MMC event.The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[11:11]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_S</name>							
						<description>Edge detect of the SD/MMC interrupt. Detect falling edge if bit 10 in the HILO register is 0. Detect rising edge if bit 10 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>CAN_E</name>									
				<description>Edge/level detect mode for C_CAN event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[12:12]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_THE_C</name>							
						<description>Edge detect of the combined C_CAN interrupt. Detect falling edge if bit 12 in the HILO register is 0. Detect rising edge if bit 12 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>TIM2_E</name>									
				<description>Edge/level detect mode for combined timer output 2 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[13:13]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_GIMA</name>							
						<description>Edge detect of GIMA output 25. Detect falling edge if bit 13 in the HILO register is 0. Detect rising edge if bit 13 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>TIM6_E</name>									
				<description>Edge/level detect mode for combined timer output 6 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[14:14]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_GIMA</name>							
						<description>Edge detect of GIMA output 26. Detect falling edge if bit 14 in the HILO register is 0. Detect rising edge if bit 14 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>QEI_E</name>									
				<description>Edge/level detect mode for QEI interrupt signal. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[15:15]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_QEI_I</name>							
						<description>Edge detect of QEI interrupt. Detect falling edge if bit 15 in the HILO register is 0. Detect rising edge if bit 15 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>TIM14_E</name>									
				<description>Edge/level detect mode for combined timer output 14 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[16:16]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>LEVEL_DETECT</name>							
						<description>Level detect.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>EDGE_DETECT_OF_GIMA</name>							
						<description>Edge detect of GIMA output 27. Detect falling edge if bit 16 in the HILO register is 0. Detect rising edge if bit 16 in the HILO register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[18:17]</bitRange>									
										
