alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
						</field>
						<field>
							<name>CALDIR</name>
							<description>Calibration direction</description>
							<bitRange>[17:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FORWARD_CALIBRATION_</name>
									<description>Forward calibration. When CALVAL is equal to the calibration counter, the RTC timers will jump by 2 seconds.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BACKWARD_CALIBRATION</name>
									<description>Backward calibration. When CALVAL is equal to the calibration counter, the RTC timers will stop incrementing for 1 second.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASEC</name>
					<description>Alarm value for Seconds</description>
					<addressOffset>0x060</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SECONDS</name>
							<description>Seconds value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AMIN</name>
					<description>Alarm value for Minutes</description>
					<addressOffset>0x064</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MINUTES</name>
							<description>Minutes value in the range of 0 to 59</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AHRS</name>
					<description>Alarm value for Hours</description>
					<addressOffset>0x068</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HOURS</name>
							<description>Hours value in the range of 0 to 23</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOM</name>
					<description>Alarm value for Day of Month</description>
					<addressOffset>0x6C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DOM</name>
							<description>Day of month value in the range of 1 to 28, 29, 30, or 31 (depending on the month and whether it is a leap year).</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOW</name>
					<description>Alarm value for Day of Week</description>
					<addressOffset>0x070</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DOW</name>
							<description>Day of week value in the range of 0 to 6.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ADOY</name>
					<description>Alarm value for Day of Year</description>
					<addressOffset>0x074</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DOY</name>
							<description>Day of year value in the range of 1 to 365 (366 for leap years).</description>
							<bitRange>[8:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:9]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AMON</name>
					<description>Alarm value for Months</description>
					<addressOffset>0x078</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MONTH</name>
							<description>Month value in the range of 1 to 12.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>AYRS</name>
					<description>Alarm value for Year</description>
					<addressOffset>0x07C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>YEAR</name>
							<description>Year value in the range of 0 to 4095.</description>
							<bitRange>[11:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				
					<register>										
		<name>ERCONTRO</name>									
		<description>Event Monitor/Recorder Control register. Contains bits that control actions for the event channels as well as for Event Monitor/Recorder setup.</description>									
		<addressOffset>0x084</addressOffset>									
		<access>read-write</access>									
		<resetValue>0</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>INTWAKE_EN0</name>							
				<description>Interrupt and wake-up enable for channel 0.</description>							
				<bitRange>[0:0]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>DISABLED</name>					
						<description>No interrupt or wake-up will be generated by event channel 0.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>ENABLED</name>					
						<description>An event in channel 0 will trigger an (RTC) interrupt and a wake-up request.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>GPCLEAR_EN0</name>							
				<description>Enables automatically clearing the RTC general purpose registers when an event occurs on channel 0.</description>							
				<bitRange>[1:1]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>DISABLED</name>					
						<description>Channel 0 has no influence on the general purpose registers.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>ENABLED</name>					
						<description>An event in channel 0 will clear the general purpose registers asynchronously.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>POL0</name>							
				<description>Selects the polarity of an event on input pin WAKEUP0.</description>							
				<bitRange>[2:2]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NEGATIVE</name>					
						<description>A channel 0 event is defined as a negative edge on WAKEUP0.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>POSITIVE</name>					
						<description>A channel 0 event is defined as a positive edge on WAKEUP0.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>EV0_INPUT_EN</name>							
				<description>Event enable control for channel 0. Event Inputs should remain DISABLED when not being used for event detection, particularly if the associated pin is being used for some other function.</description>							
				<bitRange>[3:3]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>DISABLED</name>					
						<description>Event 0 input is disabled and forced high internally.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>ENABLED</name>					
						<description>Event 0 input is enabled.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. Read value is undefined, only zero should be written.</description>							
				<bitRange>[9:4]</bitRange>							
										
