alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CGU</name>
			<description>Clock Generation Unit (CGU)</description>
			<groupName>CGU</groupName>
			<baseAddress>0x40050000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				
				
				
				
				
			<register>															
	<name>FREQ_MON</name>														
	<description>Frequency monitor register</description>														
	<addressOffset>0x014</addressOffset>														
	<access>read-write</access>														
	<resetValue>0</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>RCNT</name>												
			<description>9-bit reference clock-counter value</description>												
			<bitRange>[8:0]</bitRange>												
											
		</field>													
		<field>													
			<name>FCNT</name>												
			<description>14-bit selected clock-counter value</description>												
			<bitRange>[22:9]</bitRange>												
											
		</field>													
		<field>													
			<name>MEAS</name>												
			<description>Measure frequency</description>												
			<bitRange>[23:23]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>RCNT_AND_FCNT_DISABL</name>										
					<description>RCNT and FCNT disabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>FREQUENCY_COUNTERS_S</name>										
					<description>Frequency counters started</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>CLK_SEL</name>												
			<description>Clock-source selection for the clock to be measured. All other values are reserved.</description>												
			<bitRange>[28:24]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>32_KHZ_OSCILLATOR_D</name>										
					<description>32 kHz oscillator (default)</description>										
					<value>0x00</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IRC</name>										
					<description>IRC</description>										
					<value>0x01</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENET_RX_CLK</name>										
					<description>ENET_RX_CLK</description>										
					<value>0x02</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENET_TX_CLK</name>										
					<description>ENET_TX_CLK</description>										
					<value>0x03</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>GP_CLKIN</name>										
					<description>GP_CLKIN</description>										
					<value>0x04</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>RESERVED</name>										
					<description>Reserved</description>										
					<value>0x05</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>CRYSTAL_OSCILLATOR</name>										
					<description>Crystal oscillator</description>										
					<value>0x06</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL0USB</name>										
					<description>PLL0USB</description>										
					<value>0x07</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL0AUDIO</name>										
					<description>PLL0AUDIO</description>										
					<value>0x08</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL1</name>										
					<description>PLL1</description>										
					<value>0x09</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>RESERVED</name>										
					<description>Reserved</description>										
					<value>0x0A</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>RESERVED</name>										
					<description>Reserved</description>										
					<value>0x0B</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVA</name>										
					<description>IDIVA</description>										
					<value>0x0C</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVB</name>										
					<description>IDIVB</description>										
					<value>0x0D</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVC</name>										
					<description>IDIVC</description>										
					<value>0x0E</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVD</name>										
					<description>IDIVD</description>										
					<value>0x0F</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVE</name>										
					<description>IDIVE</description>										
					<value>0x10</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:29]</bitRange>												
											
		</field>													
	</fields>														
</register>															
<register>															
	<name>XTAL_OSC_CTRL</name>														
	<description>Crystal oscillator control register</description>														
	<addressOffset>0x018</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x00000005</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>ENABLE</name>												
			<description>Oscillator-pad enable. Do not change the BYPASS and ENABLE bits in one write-action: this will result in unstable device operation!</description>												
			<bitRange>[0:0]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>ENABLE</name>										
					<description>Enable</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>POWER_DOWN</name>										
					<description>Power-down (default)</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>BYPASS</name>												
			<description>Configure crystal operation or external-clock input pin XTAL1. Do not change the BYPASS and ENABLE bits in one write-action: this will result in unstable device operation!</description>												
			<bitRange>[1:1]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>CRYSTAL</name>										
					<description>Crystal. Operation with crystal connected (default).</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>BYPASS_MODE</name>										
					<description>Bypass mode. Use this mode when an external clock source is used instead of a crystal.</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>HF</name>												
			<description>Select frequency range</description>												
			<bitRange>[2:2]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>LOW</name>										
					<description>Low. Oscillator low-frequency mode (crystal or external clock source 1 to 20 MHz). Between 15 MHz and 20 MHz, the state of the HF bit is don't care.</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>HIGH</name>										
					<description>High. Oscillator high-frequency mode; crystal or external clock source 15 to 25 MHz. Between 15 MHz and 20 MHz, the state of the HF bit is don't care.</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:3]</bitRange>												
											
