alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
		</field>													
		<field>													
			<name>FRM</name>												
			<description>Free running mode</description>												
			<bitRange>[6:6]</bitRange>												
											
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[7:7]</bitRange>												
											
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved. Reads as zero. Do not write one to this register.</description>												
			<bitRange>[8:8]</bitRange>												
											
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved. Reads as zero. Do not write one to this register.</description>												
			<bitRange>[9:9]</bitRange>												
											
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved. Reads as zero. Do not write one to this register.</description>												
			<bitRange>[10:10]</bitRange>												
											
		</field>													
		<field>													
			<name>AUTOBLOCK</name>												
			<description>Block clock automatically during frequency change</description>												
			<bitRange>[11:11]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>DISABLED</name>										
					<description>Disabled. Autoblocking disabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENABLED</name>										
					<description>Enabled. Autoblocking enabled</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>PLLFRACT_REQ</name>												
			<description>Fractional PLL word write request. Set this bit to 1 if the fractional divider is enabled in the SEL_EXT bit.</description>												
			<bitRange>[12:12]</bitRange>												
											
		</field>													
		<field>													
			<name>SEL_EXT</name>												
			<description>Select fractional divider.</description>												
			<bitRange>[13:13]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>FRAC_ENABLED</name>										
					<description>FRAC Enabled. Enable fractional divider.</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>MDEC_ENABLED</name>										
					<description>MDEC enabled. Fractional divider not used.</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>MOD_PD</name>												
			<description>Sigma-Delta modulator power-down</description>												
			<bitRange>[14:14]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>ENABLED</name>										
					<description>Enabled. Sigma-Delta modulator enabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>DISABLED</name>										
					<description>Disabled. Sigma-Delta modulator powered down</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[23:15]</bitRange>												
											
		</field>													
		<field>													
			<name>CLK_SEL</name>												
			<description>Clock source selection. All other values are reserved.</description>												
			<bitRange>[28:24]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>32_KHZ_OSCILLATOR</name>										
					<description>32 kHz oscillator</description>										
					<value>0x00</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IRC_DEFAULT</name>										
					<description>IRC (default)</description>										
					<value>0x01</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENET_RX_CLK</name>										
					<description>ENET_RX_CLK</description>										
					<value>0x02</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENET_TX_CLK</name>										
					<description>ENET_TX_CLK</description>										
					<value>0x03</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>GP_CLKIN</name>										
					<description>GP_CLKIN</description>										
					<value>0x04</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>CRYSTAL_OSCILLATOR</name>										
					<description>Crystal oscillator</description>										
					<value>0x06</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL1</name>										
					<description>PLL1</description>										
					<value>0x09</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVA</name>										
					<description>IDIVA</description>										
					<value>0x0C</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVB</name>										
					<description>IDIVB</description>										
					<value>0x0D</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVC</name>										
					<description>IDIVC</description>										
					<value>0x0E</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVD</name>										
					<description>IDIVD</description>										
					<value>0x0F</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVE</name>										
					<description>IDIVE</description>										
					<value>0x10</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:29]</bitRange>												
											
