alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0AUDIO_MDIV</name>														
	<description>PLL0AUDIO M-divider register</description>														
	<addressOffset>0x034</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x05F85B6A</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>MDEC</name>												
			<description>Decoded M-divider coefficient value. Select values for the M-divider between 1 and 131071.</description>												
			<bitRange>[16:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:17]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0AUDIO_NP_DIV</name>														
	<description>PLL0AUDIO N/P-divider register</description>														
	<addressOffset>0x038</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x000B1002</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PDEC</name>												
			<description>Decoded P-divider coefficient value</description>												
			<bitRange>[6:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[11:7]</bitRange>												
		</field>													
		<field>													
			<name>NDEC</name>												
			<description>Decoded N-divider coefficient value</description>												
			<bitRange>[21:12]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:22]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0AUDIO_FRAC</name>														
	<description>PLL0AUDIO fractional divider register</description>														
	<addressOffset>0x03C</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x00200000</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PLLFRACT_CTRL</name>												
			<description>PLL fractional divider control word</description>												
			<bitRange>[21:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:22]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL1_STAT</name>														
	<description>PLL1 status register</description>														
	<addressOffset>0x040</addressOffset>														
	<access>read-only</access>														
	<resetValue>0x01000000</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>LOCK</name>												
			<description>PLL1 lock indicator</description>												
			<bitRange>[0:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:1]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL1_CTRL</name>														
	<description>PLL1 control register</description>														
	<addressOffset>0x044</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x01000003</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PD</name>												
			<description>PLL1 power down</description>												
			<bitRange>[0:0]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>PLL1_ENABLED</name>										
					<description>PLL1 enabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL1_POWERED_DOWN</name>										
					<description>PLL1 powered down</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>BYPASS</name>												
			<description>Input clock bypass control</description>												
			<bitRange>[1:1]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>NORMAL</name>										
					<description>Normal. CCO clock sent to post-dividers. Use for normal operation.</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>INPUT_CLOCK</name>										
					<description>Input clock. PLL1 input clock sent to post-dividers (default).</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved. Do not write one to this bit.</description>												
			<bitRange>[2:2]</bitRange>												
											
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved. Do not write one to these bits.</description>												
			<bitRange>[5:3]</bitRange>												
											
		</field>													
		<field>													
			<name>FBSEL</name>												
			<description>PLL feedback select.</description>												
			<bitRange>[6:6]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>CCO_OUT</name>										
					<description>CCO out. CCO output is used as feedback divider input clock.</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL_OUT</name>										
					<description>PLL out. PLL output clock (clkout) is used as feedback divider input clock. Use for normal operation.</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>DIRECT</name>												
			<description>PLL direct CCO output</description>												
			<bitRange>[7:7]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>DISABLED</name>										
					<description>Disabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENABLED</name>										
					<description>Enabled</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>PSEL</name>												
			<description>Post-divider division ratio P. The value applied is 2xP.</description>												
			<bitRange>[9:8]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>1</name>										
					<description>1</description>										
					<value>0x0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PEQ2</name>										
					<description>2 (default)</description>										
					<value>0x1</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PEQ4</name>										
					<description>4</description>										
					<value>0x2</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>8</name>										
					<description>8</description>										
					<value>0x3</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[10:10]</bitRange>												
											
