alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M3_ETHERNET_STAT</name>
					<description>CLK_M3_ETHERNET clock status register</description>
					<addressOffset>0x0424</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M3_USB0_STAT</name>
					<description>CLK_M3_USB0  clock status register</description>
					<addressOffset>0x042C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M3_EMC_STAT</name>
					<description>CLK_M3_EMC clock status register</description>
					<addressOffset>0x0434</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M3_SDIO_STAT</name>
					<description>CLK_M3_SDIO clock status register</description>
					<addressOffset>0x043C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M3_DMA_STAT</name>
					<description>CLK_M3_DMA clock status register</description>
					<addressOffset>0x0444</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_M3_M3CORE_STAT</name>
					<description>CLK_M3_M3CORE clock status register</description>
					<addressOffset>0x044C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

