alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
	<register>													
		<name>RESET_STATUS1</name>												
		<description>Reset status register 1</description>												
		<addressOffset>0x114</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x55555555</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>LCD_RST</name>										
				<description>Status of the LCD_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[1:0]</bitRange>										
			</field>											
			<field>											
				<name>USB0_RST</name>										
				<description>Status of the USB0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[3:2]</bitRange>										
			</field>											
			<field>											
				<name>USB1_RST</name>										
				<description>Status of the USB1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[5:4]</bitRange>										
			</field>											
			<field>											
				<name>DMA_RST</name>										
				<description>Status of the DMA_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[7:6]</bitRange>										
			</field>											
			<field>											
				<name>SDIO_RST</name>										
				<description>Status of the SDIO_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[9:8]</bitRange>										
			</field>											
			<field>											
				<name>EMC_RST</name>										
				<description>Status of the EMC_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[11:10]</bitRange>										
			</field>											
			<field>											
				<name>ETHERNET_RST</name>										
				<description>Status of the ETHERNET_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[13:12]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[15:14]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[17:16]</bitRange>										
			</field>											
			<field>											
				<name>FLASHA_RST</name>										
				<description>Status of the FLASHA_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[19:18]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[21:20]</bitRange>										
			</field>											
			<field>											
				<name>EEPROM_RST</name>										
				<description>Status of the EEPROM_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[23:22]</bitRange>										
			</field>											
			<field>											
				<name>GPIO_RST</name>										
				<description>Status of the GPIO_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[25:24]</bitRange>										
			</field>											
			<field>											
				<name>FLASHB_RST</name>										
				<description>Status of the FLASHB_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[27:26]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[29:28]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[31:30]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>RESET_STATUS2</name>												
		<description>Reset status register 2</description>												
		<addressOffset>0x118</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x55555555</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TIMER0_RST</name>										
				<description>Status of the TIMER0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[1:0]</bitRange>										
			</field>											
			<field>											
				<name>TIMER1_RST</name>										
				<description>Status of the TIMER1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[3:2]</bitRange>										
			</field>											
			<field>											
				<name>TIMER2_RST</name>										
				<description>Status of the TIMER2_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[5:4]</bitRange>										
			</field>											
			<field>											
				<name>TIMER3_RST</name>										
				<description>Status of the TIMER3_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[7:6]</bitRange>										
			</field>											
			<field>											
				<name>RITIMER_RST</name>										
				<description>Status of the RITIMER_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[9:8]</bitRange>										
			</field>											
			<field>											
				<name>SCT_RST</name>										
				<description>Status of the SCT_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[11:10]</bitRange>										
			</field>											
			<field>											
				<name>MOTOCONPWM_RST</name>										
				<description>Status of the MOTOCONPWM_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[13:12]</bitRange>										
			</field>											
			<field>											
				<name>QEI_RST</name>										
				<description>Status of the QEI_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[15:14]</bitRange>										
			</field>											
			<field>											
				<name>ADC0_RST</name>										
				<description>Status of the ADC0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[17:16]</bitRange>										
			</field>											
			<field>											
				<name>ADC1_RST</name>										
				<description>Status of the ADC1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[19:18]</bitRange>										
			</field>											
			<field>											
				<name>DAC_RST</name>										
				<description>Status of the DAC_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[21:20]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[23:22]</bitRange>										
			</field>											
			<field>											
				<name>UART0_RST</name>										
				<description>Status of the UART0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[25:24]</bitRange>										
			</field>											
			<field>											
				<name>UART1_RST</name>										
				<description>Status of the UART1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[27:26]</bitRange>										
			</field>											
			<field>											
				<name>UART2_RST</name>										
				<description>Status of the UART2_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[29:28]</bitRange>										
			</field>											
			<field>											
				<name>UART3_RST</name>										
				<description>Status of the UART3_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[31:30]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>RESET_STATUS3</name>												
		<description>Reset status register 3</description>												
		<addressOffset>0x11C</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x55555555</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>I2C0_RST</name>										
				<description>Status of the I2C0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[1:0]</bitRange>										
			</field>											
			<field>											
				<name>I2C1_RST</name>										
				<description>Status of the I2C1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[3:2]</bitRange>										
			</field>											
			<field>											
				<name>SSP0_RST</name>										
				<description>Status of the SSP0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[5:4]</bitRange>										
			</field>											
			<field>											
				<name>SSP1_RST</name>										
				<description>Status of the SSP1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[7:6]</bitRange>										
			</field>											
			<field>											
				<name>I2S_RST</name>										
				<description>Status of the I2S_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[9:8]</bitRange>										
			</field>											
			<field>											
				<name>SPIFI_RST</name>										
				<description>Status of the SPIFI_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[11:10]</bitRange>										
			</field>											
			<field>											
				<name>CAN1_RST</name>										
				<description>Status of the CAN1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[13:12]</bitRange>										
			</field>											
			<field>											
				<name>CAN0_RST</name>										
				<description>Status of the CAN0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[15:14]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[17:16]</bitRange>										
			</field>											
											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[23:18]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[25:24]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[27:26]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[29:28]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[31:30]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>RESET_ACTIVE_STATUS0</name>												
		<description>Reset active status register 0</description>												
		<addressOffset>0x150</addressOffset>												
		<access>read-only</access>												
		<resetValue>0xFFFFEFFF</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>CORE_RST</name>										
				<description>Current status of the CORE_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[0:0]</bitRange>										
			</field>											
			<field>											
				<name>PERIPH_RST</name>										
				<description>Current status of the PERIPH_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[1:1]</bitRange>										
			</field>											
			<field>											
				<name>MASTER_RST</name>										
				<description>Current status of the MASTER_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[2:2]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[3:3]</bitRange>										
			</field>											
			<field>											
				<name>WWDT_RST</name>										
				<description>Current status of the WWDT_RS 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[4:4]</bitRange>										
			</field>											
			<field>											
				<name>CREG_RST</name>										
				<description>Current status of the CREG_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[5:5]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[6:6]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[7:7]</bitRange>										
			</field>											
			<field>											
				<name>BUS_RST</name>										
				<description>Current status of the BUS_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[8:8]</bitRange>										
			</field>											
			<field>											
				<name>SCU_RST</name>										
				<description>Current status of the SCU_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[9:9]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[10:10]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[11:11]</bitRange>										
			</field>											
			<field>											
				<name>M0SUB_RST</name>										
				<description>Current status of the M0SUB_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[12:12]</bitRange>										
			</field>											
			<field>											
				<name>M3_RST</name>										
				<description>Current status of the M3_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[13:13]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[14:14]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[15:15]</bitRange>										
			</field>											
			<field>											
				<name>LCD_RST</name>										
				<description>Current status of the LCD_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[16:16]</bitRange>										
			</field>											
			<field>											
				<name>USB0_RST</name>										
				<description>Current status of the USB0_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[17:17]</bitRange>										
			</field>											
			<field>											
				<name>USB1_RST</name>										
				<description>Current status of the USB1_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[18:18]</bitRange>										
			</field>											
			<field>											
				<name>DMA_RST</name>										
				<description>Current status of the DMA_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[19:19]</bitRange>										
			</field>											
			<field>											
				<name>SDIO_RST</name>										
				<description>Current status of the SDIO_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[20:20]</bitRange>										
			</field>											
			<field>											
				<name>EMC_RST</name>										
				<description>Current status of the EMC_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[21:21]</bitRange>										
			</field>											
			<field>											
				<name>ETHERNET_RST</name>										
				<description>Current status of the ETHERNET_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[22:22]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[23:23]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[24:24]</bitRange>										
			</field>											
			<field>											
				<name>FLASHA_RST</name>										
				<description>Current status of the FLASHA_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[25:25]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[26:26]</bitRange>										
			</field>											
			<field>											
				<name>EEPROM_RST</name>										
				<description>Current status of the EEPROM_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[27:27]</bitRange>										
			</field>											
			<field>											
				<name>GPIO_RST</name>										
				<description>Current status of the GPIO_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[28:28]</bitRange>										
			</field>											
			<field>											
				<name>FLASHB_RST</name>										
				<description>Current status of the FLASHB_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[29:29]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[30:30]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[31:31]</bitRange>										
			</field>											
		</fields>												
	</register>													
