alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
	<register>													
		<name>RESET_ACTIVE_STATUS1</name>												
		<description>Reset active status register 1</description>												
		<addressOffset>0x154</addressOffset>												
		<access>read-only</access>												
		<resetValue>0xFEFFFFFF</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TIMER0_RST</name>										
				<description>Current status of the TIMER0_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[0:0]</bitRange>										
			</field>											
			<field>											
				<name>TIMER1_RST</name>										
				<description>Current status of the TIMER1_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[1:1]</bitRange>										
			</field>											
			<field>											
				<name>TIMER2_RST</name>										
				<description>Current status of the TIMER2_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[2:2]</bitRange>										
			</field>											
			<field>											
				<name>TIMER3_RST</name>										
				<description>Current status of the TIMER3_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[3:3]</bitRange>										
			</field>											
			<field>											
				<name>RITIMER_RST</name>										
				<description>Current status of the RITIMER_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[4:4]</bitRange>										
			</field>											
			<field>											
				<name>SCT_RST</name>										
				<description>Current status of the SCT_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[5:5]</bitRange>										
			</field>											
			<field>											
				<name>MOTOCONPWM_RST</name>										
				<description>Current status of the MOTOCONPWM_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[6:6]</bitRange>										
			</field>											
			<field>											
				<name>QEI_RST</name>										
				<description>Current status of the QEI_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[7:7]</bitRange>										
			</field>											
			<field>											
				<name>ADC0_RST</name>										
				<description>Current status of the ADC0_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[8:8]</bitRange>										
			</field>											
			<field>											
				<name>ADC1_RST</name>										
				<description>Current status of the ADC1_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[9:9]</bitRange>										
			</field>											
			<field>											
				<name>DAC_RST</name>										
				<description>Current status of the DAC_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[10:10]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[11:11]</bitRange>										
			</field>											
			<field>											
				<name>UART0_RST</name>										
				<description>Current status of the UART0_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[12:12]</bitRange>										
			</field>											
			<field>											
				<name>UART1_RST</name>										
				<description>Current status of the UART1_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[13:13]</bitRange>										
			</field>											
			<field>											
				<name>UART2_RST</name>										
				<description>Current status of the UART2_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[14:14]</bitRange>										
			</field>											
			<field>											
				<name>UART3_RST</name>										
				<description>Current status of the UART3_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[15:15]</bitRange>										
			</field>											
			<field>											
				<name>I2C0_RST</name>										
				<description>Current status of the I2C0_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[16:16]</bitRange>										
			</field>											
			<field>											
				<name>I2C1_RST</name>										
				<description>Current status of the I2C1_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[17:17]</bitRange>										
			</field>											
			<field>											
				<name>SSP0_RST</name>										
				<description>Current status of the SSP0_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[18:18]</bitRange>										
			</field>											
			<field>											
				<name>SSP1_RST</name>										
				<description>Current status of the SSP1_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[19:19]</bitRange>										
			</field>											
			<field>											
				<name>I2S_RST</name>										
				<description>Current status of the I2S_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[20:20]</bitRange>										
			</field>											
			<field>											
				<name>SPIFI_RST</name>										
				<description>Current status of the SPIFI_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[21:21]</bitRange>										
			</field>											
			<field>											
				<name>CAN1_RST</name>										
				<description>Current status of the CAN1_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[22:22]</bitRange>										
			</field>											
			<field>											
				<name>CAN0_RST</name>										
				<description>Current status of the CAN0_RST 0 = Reset asserted 1 = No reset</description>										
				<bitRange>[23:23]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[24:24]</bitRange>										
			</field>											
												
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[27:25]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[28:28]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[29:29]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[30:30]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[31:31]</bitRange>										
			</field>											
		</fields>												
	</register>													

				
				
				
				
				
				
				<register>
					<name>RESET_EXT_STAT1</name>
					<description>Reset external status register 1 for PERIPH_RST</description>
					<addressOffset>0x404</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CORE_RESET</name>
							<description>Reset activated by CORE_RST output. Write 0 to clear. 0 = Reset not activated 1 = Reset activated</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT2</name>
					<description>Reset external status register 2 for MASTER_RST</description>
					<addressOffset>0x408</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				
				<register>
					<name>RESET_EXT_STAT5</name>
					<description>Reset external status register 5 for CREG_RST</description>
					<addressOffset>0x414</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>CORE_RESET</name>
							<description>Reset activated by CORE_RST output. Write 0 to clear. 0 = Reset not activated 1 = Reset activated</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT8</name>
					<description>Reset external status register</description>
					<addressOffset>0x420</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT9</name>
					<description>Reset external status register</description>
					<addressOffset>0x0424</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				
				<register>
					<name>RESET_EXT_STAT13</name>
					<description>Reset external status register</description>
					<addressOffset>0x434</addressOffset>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT16</name>
					<description>Reset external status register</description>
					<addressOffset>0x440</addressOffset>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT17</name>
					<description>Reset external status register</description>
					<addressOffset>0x0444</addressOffset>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT18</name>
					<description>Reset external status register</description>
					<addressOffset>0x0448</addressOffset>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT19</name>
					<description>Reset external status register</description>
					<addressOffset>0x044C</addressOffset>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT20</name>
					<description>Reset external status register</description>
					<addressOffset>0x0450</addressOffset>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT21</name>
					<description>Reset external status register</description>
					<addressOffset>0x0454</addressOffset>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT22</name>
					<description>Reset external status register</description>
					<addressOffset>0x0458</addressOffset>
					<access>read-write</access>
					<resetValue>0x8</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT25</name>
					<description>Reset external status register</description>
					<addressOffset>0x0464</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT27</name>
					<description>Reset external status register</description>
					<addressOffset>0x046C</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT28</name>
					<description>Reset external status register</description>
					<addressOffset>0x470</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT29</name>
					<description>Reset external status register</description>
					<addressOffset>0x0474</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[2:0]</bitRange>
						</field>
						<field>
							<name>MASTER_RESET</name>
							<description>Reset activated by MASTER_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT32</name>
					<description>Reset external status register</description>
					<addressOffset>0x480</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_EXT_STAT33</name>
					<description>Reset external status register</description>
					<addressOffset>0x0484</addressOffset>
					<access>read-write</access>
					<resetValue>0x4</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>PERIPHERAL_RESET</name>
							<description>Reset activated by PERIPHERAL_RST output. Write 0 to clear. 0 = Reset not activated  1 = Reset activated</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not modify; read as logic 0.</description>
							<bitRange>[31:3]</bitRange>
						</field>
					</fields>
				</register>
