alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</registers>
		</peripheral>

		<peripheral>
			<name>USART0</name>
			<description>USART0_2_3</description>
			<groupName>USART</groupName>
			<baseAddress>0x40081000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x300</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USART0</name>
				<value>24</value>

			</interrupt>
			<registers>															
	<register>														
		<name>RBR</name>													
		<description>Receiver Buffer Register. Contains the next received character to be read (DLAB = 0).</description>													
		<addressOffset>0x000</addressOffset>													
		<access>read-only</access>													
		<resetValue>0</resetValue>													
		<resetMask>0x00000000</resetMask>	
		<readAction>modify</readAction>
		<fields>													
			<field>												
				<name>RBR</name>											
				<description>Receiver buffer. The USART Receiver Buffer Register contains the oldest received byte in the USART RX FIFO.</description>											
				<bitRange>[7:0]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>THR</name>													
		<description>Transmit Holding Register. The next character to be transmitted is written here (DLAB = 0).</description>
		<alternateRegister>RBR</alternateRegister>
		<addressOffset>0x000</addressOffset>													
		<access>write-only</access>													
		<resetValue>0</resetValue>													
		<resetMask>0x00000000</resetMask>	
		<readAction>modify</readAction>
		<fields>													
			<field>												
				<name>THR</name>											
				<description>Transmit Holding Register. Writing to the USART Transmit Holding Register causes the data to be stored in the USART transmit FIFO. The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available.</description>											
				<bitRange>[7:0]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>DLL</name>													
		<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB = 1).</description>
		<alternateRegister>RBR</alternateRegister>
		<addressOffset>0x000</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x01</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>DLLSB</name>											
				<description>Divisor latch LSB. The USART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the USART.</description>											
				<bitRange>[7:0]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>DLM</name>													
		<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider (DLAB = 1).</description>													
		<addressOffset>0x004</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>DLMSB</name>											
				<description>Divisor latch MSB.  The USART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the USART.</description>											
				<bitRange>[7:0]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>IER</name>													
		<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential USART interrupts (DLAB = 0).</description>
		<alternateRegister>DLM</alternateRegister>
		<addressOffset>0x004</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>RBRIE</name>											
				<description>RBR Interrupt Enable. Enables the Receive Data Available interrupt for USART. It also controls the Character Receive Time-out interrupt.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLE</name>									
						<description>Disable. Disable the RDA interrupt.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLE</name>									
						<description>Enable. Enable the RDA interrupt.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>THREIE</name>											
				<description>THRE Interrupt Enable. Enables the THRE interrupt for USART. The status of this interrupt can be read from LSR[5].</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLE</name>									
						<description>Disable. Disable the THRE interrupt.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLE</name>									
						<description>Enable. Enable the THRE interrupt.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RXIE</name>											
				<description>RX Line Interrupt Enable. Enables the USART RX line status interrupts. The status of this interrupt can be read from LSR[4:1].</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLE</name>									
						<description>Disable. Disable the RX line status interrupts.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLE</name>									
						<description>Enable. Enable the RX line status interrupts.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[3:3]</bitRange>											
										
