alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:10]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>FCR</name>													
		<description>FIFO Control Register. Controls USART FIFO usage and modes.</description>													
		<addressOffset>0x008</addressOffset>													
		<access>write-only</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>FIFOEN</name>											
				<description>FIFO Enable.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. USART FIFOs are disabled. Must not be used in the application.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Active high enable for both USART Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper USART operation. Any transition on this bit will automatically clear the USART FIFOs.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RXFIFORES</name>											
				<description>RX FIFO Reset.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_EFFECT</name>									
						<description>No effect. No impact on either of USART FIFOs.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CLEAR</name>									
						<description>Clear. Writing a logic 1 to FCR[1] will clear all bytes in USART Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>TXFIFORES</name>											
				<description>TX FIFO Reset.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_EFFECT</name>									
						<description>No effect. No impact on either of USART FIFOs.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CLEAR</name>									
						<description>Clear. Writing a logic 1 to FCR[2] will clear all bytes in USART TX FIFO, reset the pointer logic. This bit is self-clearing.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>DMAMODE</name>											
				<description>DMA Mode Select. When the FIFO enable bit (bit 0 of this register) is set, this bit selects the DMA mode.</description>											
				<bitRange>[3:3]</bitRange>											
										
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[5:4]</bitRange>											
										
			</field>												
			<field>												
				<name>RXTRIGLVL</name>											
				<description>RX Trigger Level. These two bits determine how many receiver USART FIFO characters must be written before an interrupt is activated.</description>											
				<bitRange>[7:6]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>LEVEL_0</name>									
						<description>Level 0. Trigger level 0 (1 character or 0x01).</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>LEVEL_1</name>									
						<description>Level 1. Trigger level 1 (4 characters or 0x04).</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>LEVEL_2</name>									
						<description>Level 2. Trigger level 2 (8 characters or 0x08).</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>LEVEL_3</name>									
						<description>Level 3. Trigger level 3 (14 characters or 0x0E).</description>									
						<value>0x3</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:8]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>LCR</name>													
		<description>Line Control Register. Contains controls for frame formatting and break generation.</description>													
		<addressOffset>0x00C</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>WLS</name>											
				<description>Word Length Select.</description>											
				<bitRange>[1:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>5_BIT_CHARACTER_LENG</name>									
						<description>5-bit character length.</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>6_BIT_CHARACTER_LENG</name>									
						<description>6-bit character length.</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>7_BIT_CHARACTER_LENG</name>									
						<description>7-bit character length.</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>8_BIT_CHARACTER_LENG</name>									
						<description>8-bit character length.</description>									
						<value>0x3</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>SBS</name>											
				<description>Stop Bit Select.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>1_STOP_BIT</name>									
						<description>1 stop bit.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>2_STOP_BITS_1</name>									
						<description>2 stop bits (1.5 if LCR[1:0]=00).</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>PE</name>											
				<description>Parity Enable</description>											
				<bitRange>[3:3]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLE_PARITY_GENER</name>									
						<description>Disable parity generation and checking.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLE_PARITY_GENERA</name>									
						<description>Enable parity generation and checking.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>PS</name>											
				<description>Parity Select.</description>											
				<bitRange>[5:4]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>ODD_PARITY</name>									
						<description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>EVEN_PARITY</name>									
						<description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>FORCE_HIGH</name>									
						<description>Force HIGH. Forced 1 stick parity.</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>FORCE_LOW</name>									
						<description>Force LOW. Forced 0 stick parity.</description>									
						<value>0x3</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>BC</name>											
				<description>Break Control.</description>											
				<bitRange>[6:6]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Disable break transmission.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Enable break transmission. Output pin USART TXD is forced to logic 0 when LCR[6] is active high.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>DLAB</name>											
				<description>Divisor Latch Access Bit.</description>											
				<bitRange>[7:7]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Disable access to Divisor Latches.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Enable access to Divisor Latches.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:8]</bitRange>											
										
