alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>SCR</name>													
		<description>Scratch Pad Register. Eight-bit temporary storage for software.</description>													
		<addressOffset>0x01C</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>PAD</name>											
				<description>Scratch pad. A readable, writable byte.</description>											
				<bitRange>[7:0]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>ACR</name>													
		<description>Auto-baud Control Register. Contains controls for the auto-baud feature.</description>													
		<addressOffset>0x020</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>START</name>											
				<description>Start bit. This bit is automatically cleared after auto-baud completion.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>STOP</name>									
						<description>Stop. Auto-baud stop (auto-baud is not running).</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>START</name>									
						<description>Start. Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>MODE</name>											
				<description>Auto-baud mode select bit.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>MODE_0</name>									
						<description>Mode 0.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>MODE_1</name>									
						<description>Mode 1.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>AUTORESTART</name>											
				<description>Restart bit.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_RESTART</name>									
						<description>No restart.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RESTART</name>									
						<description>Restart. Restart in case of time-out (counter restarts at next USART Rx falling edge)</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[7:3]</bitRange>											
										
			</field>												
			<field>												
				<name>ABEOINTCLR</name>											
				<description>End of auto-baud interrupt clear bit (write-only).</description>											
				<bitRange>[8:8]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_EFFECT</name>									
						<description>No effect. Writing a 0 has no impact.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CLEAR</name>									
						<description>Clear. Writing a 1 will clear the corresponding interrupt in the IIR.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>ABTOINTCLR</name>											
				<description>Auto-baud time-out interrupt clear bit (write-only).</description>											
				<bitRange>[9:9]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_EFFECT</name>									
						<description>No effect. Writing a 0 has no impact.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CLEAR</name>									
						<description>Clear. Writing a 1 will clear the corresponding interrupt in the IIR.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:10]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>ICR</name>													
		<description>IrDA control register (USART3 only)</description>													
		<addressOffset>0x024</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>IRDAEN</name>											
				<description>IrDA mode enable.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. IrDA mode on USART3 is disabled, USART3 acts as a standard USART.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. IrDA mode on USART3 is enabled.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>IRDAINV</name>											
				<description>Serial input direction.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NOT_INVERTED</name>									
						<description>Not inverted. The serial input is not inverted.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>INVERTED</name>									
						<description>Inverted. The serial input is inverted. This has no effect on the serial output.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>FIXPULSEEN</name>											
				<description>IrDA fixed pulse width mode.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. IrDA fixed pulse width mode disabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. IrDA fixed pulse width mode enabled.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>PULSEDIV</name>											
				<description>Configures the pulse when FixPulseEn = 1. See Table 885 for details.</description>											
				<bitRange>[5:3]</bitRange>											
										
