alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>												
			<field>												
				<name>TXRETRY</name>											
				<description>Maximum number of retransmissions in case of a negative acknowledge (protocol T=0). When the retry counter is exceeded, the USART will be locked until the FIFO is cleared. A TX error interrupt is generated when enabled.</description>											
				<bitRange>[7:5]</bitRange>											
										
			</field>												
			<field>												
				<name>GUARDTIME</name>											
				<description>Extra guard time. No extra guard time (0x0) results in a standard guard time as defined in ISO 7816-3, depending on the protocol type. A guard time of 0xFF indicates a minimal guard time as defined for the selected protocol.</description>											
				<bitRange>[15:8]</bitRange>											
										
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:16]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>RS485CTRL</name>													
		<description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.</description>													
		<addressOffset>0x04C</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>NMMEN</name>											
				<description>NMM enable.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the USART to set the parity error and generate an interrupt.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RXDIS</name>											
				<description>Receiver enable.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. The receiver is enabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled.The receiver is disabled.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>AADEN</name>											
				<description>AAD enable</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Auto Address Detect (AAD) is disabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Auto Address Detect (AAD) is enabled.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved.</description>											
				<bitRange>[3:3]</bitRange>											
										
			</field>												
			<field>												
				<name>DCTRL</name>											
				<description>Direction control for DIR pin.</description>											
				<bitRange>[4:4]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Disable Auto Direction Control.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Enable Auto Direction Control.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>OINV</name>											
				<description>Direction control pin polarity. This bit reverses the polarity of the direction control signal on the DIR pin.</description>											
				<bitRange>[5:5]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>LOW</name>									
						<description>Low. The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>HIGH</name>									
						<description>High. The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:6]</bitRange>											
										
