alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>												
			<field>												
				<name>CTSIE</name>											
				<description>CTS Interrupt Enable. If auto-cts mode is enabled this bit enables/disables the modem status interrupt generation on a CTS1 signal transition. If auto-cts mode is disabled a CTS1 transition will generate an interrupt if Modem Status Interrupt Enable (IER[3]) is set. In normal operation a CTS1 signal transition will generate a Modem Status Interrupt unless the interrupt has been disabled by clearing the IER[3] bit in the IER register. In auto-cts mode a transition on the CTS1 bit will trigger an interrupt only if both the IER[3] and IER[7] bits are set.</description>											
				<bitRange>[7:7]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLE</name>									
						<description>Disable. Disable the CTS interrupt.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLE</name>									
						<description>Enable. Enable the CTS interrupt.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>ABEOIE</name>											
				<description>Enables the end of auto-baud interrupt.</description>											
				<bitRange>[8:8]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLE</name>									
						<description>Disable. Disable end of auto-baud Interrupt.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLE</name>									
						<description>Enable. Enable end of auto-baud Interrupt.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>ABTOIE</name>											
				<description>Enables the auto-baud time-out interrupt.</description>											
				<bitRange>[9:9]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLE</name>									
						<description>Disable. Disable auto-baud time-out Interrupt.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLE</name>									
						<description>Enable. Enable auto-baud time-out Interrupt.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:10]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>IIR</name>													
		<description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>													
		<addressOffset>0x008</addressOffset>													
		<access>read-only</access>													
		<resetValue>0x01</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>INTSTATUS</name>											
				<description>Interrupt status. Note that IIR[0] is active low. The pending interrupt can be determined by evaluating IIR[3:1].</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>INTERRUPT_PENDING</name>									
						<description>Interrupt pending. At least one interrupt is pending.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>NOT_PENDING</name>									
						<description>Not pending. No interrupt is pending.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>INTID</name>											
				<description>Interrupt identification. IER[3:1] identifies an interrupt corresponding to the UART1 Rx or TX FIFO. All other combinations of IER[3:1] not listed below are reserved (100,101,111).</description>											
				<bitRange>[3:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>RLS</name>									
						<description>RLS. Priority 1 (highest). (Highest) Receive Line Status (RLS).</description>									
						<value>0x3</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RDA</name>									
						<description>RDA. Priority 2 - Receive Data Available (RDA).</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CTI</name>									
						<description>CTI. Priority 2 - Character Time-out Indicator (CTI).</description>									
						<value>0x6</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>THRE</name>									
						<description>THRE. Priority 3 - THRE Interrupt.</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RESERVED</name>									
						<description>Reserved. Priority 4 (lowest) - Reserved.</description>									
						<value>0x0</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[5:4]</bitRange>											
										
