alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>												
			<field>												
				<name>FIFOENABLE</name>											
				<description>Copies of FCR[0].</description>											
				<bitRange>[7:6]</bitRange>											
										
			</field>												
			<field>												
				<name>ABEOINT</name>											
				<description>End of auto-baud interrupt. True if auto-baud has finished successfully and interrupt is enabled.</description>											
				<bitRange>[8:8]</bitRange>											
										
			</field>												
			<field>												
				<name>ABTOINT</name>											
				<description>Auto-baud time-out interrupt. True if auto-baud has timed out and interrupt is enabled.</description>											
				<bitRange>[9:9]</bitRange>											
										
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, the value read from a reserved bit is not defined.</description>											
				<bitRange>[31:10]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>FCR</name>													
		<description>FIFO Control Register. Controls UART1 FIFO usage and modes.</description>													
		<addressOffset>0x008</addressOffset>													
		<access>write-only</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>FIFOEN</name>											
				<description>FIFO enable.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Must not be used in the application.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Active high enable for both UART1 Rx and TX FIFOs and FCR[7:1] access. This bit must be set for proper UART1 operation. Any transition on this bit will automatically clear the UART1 FIFOs.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RXFIFORES</name>											
				<description>RX FIFO Reset.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_EFFECT</name>									
						<description>No effect. No impact on either of UART1 FIFOs.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CLEAR</name>									
						<description>Clear. Writing a logic 1 to FCR[1] will clear all bytes in UART1 Rx FIFO, reset the pointer logic. This bit is self-clearing.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>TXFIFORES</name>											
				<description>TX FIFO Reset.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_EFFECT</name>									
						<description>No effect. No impact on either of UART1 FIFOs.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CLEAR</name>									
						<description>Clear. Writing a logic 1 to FCR[2] will clear all bytes in UART1 TX FIFO, reset the pointer logic. This bit is self-clearing.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>DMAMODE</name>											
				<description>DMA Mode Select. When the FIFO enable bit (bit 0 of this register) is set, this bit selects the DMA mode. See Section 39.6.6.1.</description>											
				<bitRange>[3:3]</bitRange>											
										
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[5:4]</bitRange>											
										
			</field>												
			<field>												
				<name>RXTRIGLVL</name>											
				<description>RX Trigger Level. These two bits determine how many receiver UART1 FIFO characters must be written before an interrupt is activated.</description>											
				<bitRange>[7:6]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>LEVEL_0</name>									
						<description>Level 0. Trigger level 0 (1 character or 0x01).</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>LEVEL_1</name>									
						<description>Level 1. Trigger level 1 (4 characters or 0x04).</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>LEVEL_2</name>									
						<description>Level 2. Trigger level 2 (8 characters or 0x08).</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>LEVEL_3</name>									
						<description>Level 3. Trigger level 3 (14 characters or 0x0E).</description>									
						<value>0x3</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits.</description>											
				<bitRange>[31:8]</bitRange>											
										
