alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>LCR</name>													
		<description>Line Control Register. Contains controls for frame formatting and break generation.</description>													
		<addressOffset>0x00C</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>WLS</name>											
				<description>Word Length Select.</description>											
				<bitRange>[1:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>5_BIT_CHARACTER_LENG</name>									
						<description>5-bit character length.</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>6_BIT_CHARACTER_LENG</name>									
						<description>6-bit character length.</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>7_BIT_CHARACTER_LENG</name>									
						<description>7-bit character length.</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>8_BIT_CHARACTER_LENG</name>									
						<description>8-bit character length.</description>									
						<value>0x3</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>SBS</name>											
				<description>Stop Bit Select.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>1_STOP_BIT</name>									
						<description>1 stop bit.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>2_STOP_BITS</name>									
						<description>2 stop bits. (1.5 if LCR[1:0]=00).</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>PE</name>											
				<description>Parity Enable.</description>											
				<bitRange>[3:3]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLE_PARITY_GENER</name>									
						<description>Disable parity generation and checking.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLE_PARITY_GENERA</name>									
						<description>Enable parity generation and checking.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>PS</name>											
				<description>Parity Select.</description>											
				<bitRange>[5:4]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>ODD_PARITY</name>									
						<description>Odd parity. Number of 1s in the transmitted character and the attached parity bit will be odd.</description>									
						<value>0x0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>EVEN_PARITY</name>									
						<description>Even Parity. Number of 1s in the transmitted character and the attached parity bit will be even.</description>									
						<value>0x1</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>FORCE_HIGH</name>									
						<description>Force HIGH. Forced 1 stick parity.</description>									
						<value>0x2</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>FORCE_LOW</name>									
						<description>Force LOW. Forced 0 stick parity.</description>									
						<value>0x3</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>BC</name>											
				<description>Break Control.</description>											
				<bitRange>[6:6]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Disable break transmission.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Enable break transmission. Output pin UART1 TXD is forced to logic 0 when LCR[6] is active high.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>DLAB</name>											
				<description>Divisor Latch Access Bit (DLAB)</description>											
				<bitRange>[7:7]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Disable access to Divisor Latches.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Enable access to Divisor Latches.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:8]</bitRange>											
										
