alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>MSR</name>													
		<description>Modem Status Register. Contains handshake signal status flags.</description>													
		<addressOffset>0x018</addressOffset>													
		<access>read-only</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>	
		<readAction>modify</readAction>
		<fields>													
			<field>												
				<name>DCTS</name>											
				<description>Delta CTS. Set upon state change of input CTS. Cleared on an MSR read.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_CHANGE</name>									
						<description>No change. No change detected on modem input, CTS.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>STATE_CHANGE</name>									
						<description>State change. State change detected on modem input, CTS.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>DDSR</name>											
				<description>Delta DSR. Set upon state change of input DSR. Cleared on an MSR read.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_CHANGE</name>									
						<description>No change. No change detected on modem input, DSR.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>STATE_CHANGE</name>									
						<description>State change. State change detected on modem input, DSR.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>TERI</name>											
				<description>Trailing Edge RI. Set upon low to high transition of input RI. Cleared on an MSR read.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_CHANGE</name>									
						<description>No change. No change detected on modem input, RI.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RISING</name>									
						<description>Rising. Low-to-high transition detected on RI.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>DDCD</name>											
				<description>Delta DCD. Set upon state change of input DCD. Cleared on an MSR read.</description>											
				<bitRange>[3:3]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_CHANGE</name>									
						<description>No change. No change detected on modem input, DCD.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>STATE_CHANGE</name>									
						<description>State change. State change detected on modem input, DCD.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>CTS</name>											
				<description>Clear To Send State. Complement of input signal CTS. This bit is connected to MCR[1] in modem loopback mode.</description>											
				<bitRange>[4:4]</bitRange>											
										
			</field>												
			<field>												
				<name>DSR</name>											
				<description>Data Set Ready State. Complement of input signal DSR. This bit is connected to MCR[0] in modem loopback mode.</description>											
				<bitRange>[5:5]</bitRange>											
										
			</field>												
			<field>												
				<name>RI</name>											
				<description>Ring Indicator State. Complement of input RI. This bit is connected to MCR[2] in modem loopback mode.</description>											
				<bitRange>[6:6]</bitRange>											
										
			</field>												
			<field>												
				<name>DCD</name>											
				<description>Data Carrier Detect State. Complement of input DCD. This bit is connected to MCR[3] in modem loopback mode.</description>											
				<bitRange>[7:7]</bitRange>											
										
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, the value read from a reserved bit is not defined.</description>											
				<bitRange>[31:8]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>SCR</name>													
		<description>Scratch Pad Register. 8-bit temporary storage for software.</description>													
		<addressOffset>0x01C</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>Pad</name>											
				<description>Scratch pad. A readable, writable byte.</description>											
				<bitRange>[7:0]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, the value read from a reserved bit is not defined.</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>ACR</name>													
		<description>Auto-baud Control Register. Contains controls for the auto-baud feature.</description>													
		<addressOffset>0x020</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>START</name>											
				<description>Auto-baud start bit. This bit is automatically cleared after auto-baud completion.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>STOP</name>									
						<description>Stop. Auto-baud stop (auto-baud is not running).</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>START</name>									
						<description>Start. Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>MODE</name>											
				<description>Auto-baud mode select bit.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>MODE_0</name>									
						<description>Mode 0.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>MODE_1</name>									
						<description>Mode 1.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>AUTORESTART</name>											
				<description>Auto-baud restart bit.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_RESTART</name>									
						<description>No restart</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>RESTART</name>									
						<description>Restart. Restart in case of time-out (counter restarts at next UART1 Rx falling edge)</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[7:3]</bitRange>											
										
