alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>												
			<field>												
				<name>ABEOINTCLR</name>											
				<description>End of auto-baud interrupt clear bit (write-only).</description>											
				<bitRange>[8:8]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_EFFECT</name>									
						<description>No effect. Writing a 0 has no impact.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CLEAR</name>									
						<description>Clear. Writing a 1 will clear the corresponding interrupt in the IIR.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>ABTOINTCLR</name>											
				<description>Auto-baud time-out interrupt clear bit (write-only).</description>											
				<bitRange>[9:9]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_EFFECT</name>									
						<description>No effect. Writing a 0 has no impact.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CLEAR</name>									
						<description>Clear. Writing a 1 will clear the corresponding interrupt in the IIR.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:10]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>FDR</name>													
		<description>Fractional Divider Register. Generates a clock input for the baud rate divider.</description>													
		<addressOffset>0x028</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x10</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>DIVADDVAL</name>											
				<description>Baud-rate generation pre-scaler divisor value. If this field is 0, fractional baud-rate generator will not impact the UARTn baudrate.</description>											
				<bitRange>[3:0]</bitRange>											
			</field>												
			<field>												
				<name>MULVAL</name>											
				<description>Baud-rate pre-scaler multiplier value. This field must be greater or equal 1 for UARTn to operate properly, regardless of whether the fractional baud-rate generator is used or not.</description>											
				<bitRange>[7:4]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>RS485CTRL</name>													
		<description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.</description>													
		<addressOffset>0x04C</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>NMMEN</name>											
				<description>Multidrop mode select.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the USART to set the parity error and generate an interrupt.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RXDIS</name>											
				<description>Receive enable.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. The receiver is enabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled.The receiver is disabled.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>AADEN</name>											
				<description>Auto Address Detect enable.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Auto Address Detect (AAD) is disabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Auto Address Detect (AAD) is enabled.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>SEL</name>											
				<description>Direction control.</description>											
				<bitRange>[3:3]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>RTS</name>									
						<description>RTS. If direction control is enabled (bit DCTRL = 1), pin RTS is used for direction control.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>DTR</name>									
						<description>DTR. If direction control is enabled (bit DCTRL = 1), pin DTR is used for direction control.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>DCTRL</name>											
				<description>Direction control enable.</description>											
				<bitRange>[4:4]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Disable Auto Direction Control.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Enable Auto Direction Control.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>OINV</name>											
				<description>Polarity. This bit reverses the polarity of the direction control signal on the RTS (or DTR) pin.</description>											
				<bitRange>[5:5]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>LOW</name>									
						<description>Low. The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>HIGH</name>									
						<description>High. The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:6]</bitRange>											
										
