alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[13:13]</bitRange>
							
						</field>
						<field>
							<name>MDIR</name>
							<description>Mask message direction</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_MESSAGE_DIRECTIO</name>
									<description>The message direction bit (DIR) is used for acceptance filtering.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_MESSAGE_DIRECTIO</name>
									<description>The message direction bit (DIR) has no effect on acceptance filtering.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MXTD</name>
							<description>Mask extend identifier</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_EXTENDED_IDENTIF</name>
									<description>The extended identifier bit (IDE) is used for acceptance filtering.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_EXTENDED_IDENTIF</name>
									<description>The extended identifier bit (IDE) has no effect on acceptance filtering.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x60</dimIncrement>
					<dimIndex>1-2</dimIndex>
					<name>IF%s_ARB1</name>
					<description>Message interface 1 arbitration 1</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ID15_0</name>
							<description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x60</dimIncrement>
					<dimIndex>1-2</dimIndex>
					<name>IF%s_ARB2</name>
					<description>Message interface 1 arbitration 2</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ID28_16</name>
							<description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
							<bitRange>[12:0]</bitRange>
							
						</field>
						<field>
							<name>DIR</name>
							<description>Message direction</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DIRECTION_EQ_TRANSMIT</name>
									<description>Direction = transmit. On TXRQST, the respective Message Object is transmitted as a Data Frame. On reception of a Remote Frame with matching identifier, the TXRQST bit of this Message Object is set (if RMTEN = one).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIRECTION_EQ_RECEIVE_</name>
									<description>Direction = receive. On TXRQST, a Remote Frame with the identifier of this Message Object is transmitted. On reception of a Data Frame with matching identifier, that message is stored in this Message Object.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XTD</name>
							<description>Extend identifier</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_29_BIT_EXTENDED_</name>
									<description>The 29-bit extended identifier will be used for this message object.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_11_BIT_STANDARD_</name>
									<description>The 11-bit standard identifier will be used for this message object.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSGVAL</name>
							<description>Message valid The CPU must reset the MSGVAL bit of all unused Messages Objects during the initialization before it resets bit INIT in the CAN Control Register. This bit must also be reset before the identifier ID28:0, the control bits XTD, DIR, or the Data Length Code DLC3:0 are modified, or if the Messages Object is no longer required.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_MESSAGE_OBJECT_I</name>
									<description>The message object is configured and should be considered by the message handler.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_MESSAGE_OBJECT_I</name>
									<description>The message object is ignored by the message handler.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x60</dimIncrement>
					<dimIndex>1-2</dimIndex>
					<name>IF%s_MCTRL</name>
					<description>Message interface 1 message control</description>
					<addressOffset>0x038</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLC3_0</name>
							<description>Data length code The Data Length Code of a Message Object must be defined the same as in all the corresponding objects with the same identifier at other nodes. When the Message Handler stores a data frame, it will write the DLC to the value given by the received message. 0000 to 1000 = Data frame has 0 - 8 data bytes. 1001 to 1111 = Data frame has 8 data bytes.</description>
							<bitRange>[3:0]</bitRange>
							
