alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>ADCSTART1_IN</name>															
		<description>ADC start1 input   multiplexer (GIMA output 29)</description>															
		<addressOffset>0x074</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>INV</name>													
				<description>Invert input</description>													
				<bitRange>[0:0]</bitRange>													
																	
				<enumeratedValues>													
				<name>ENUM</name>													
																	
					<enumeratedValue>												
						<name>NOT_INVERTED</name>											
						<description>Not inverted.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>INPUT_INVERTED</name>											
						<description>Input inverted.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>EDGE</name>													
				<description>Enable rising edge detection</description>													
				<bitRange>[1:1]</bitRange>													
																	
				<enumeratedValues>													
				<name>ENUM</name>													
																	
					<enumeratedValue>												
						<name>NO_EDGE_DETECTION</name>											
						<description>No edge detection.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>RISING_EDGE_DETECTIO</name>											
						<description>Rising edge detection enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SYNCH</name>													
				<description>Enable   synchronization</description>													
				<bitRange>[2:2]</bitRange>													
																	
				<enumeratedValues>													
				<name>ENUM</name>													
																	
					<enumeratedValue>												
						<name>DISABLE__SYNCHRONIZ</name>											
						<description>Disable   synchronization.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE__SYNCHRONIZA</name>											
						<description>Enable   synchronization.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>PULSE</name>													
				<description>Enable single pulse generation.</description>													
				<bitRange>[3:3]</bitRange>													
																	
				<enumeratedValues>													
				<name>ENUM</name>													
																	
					<enumeratedValue>												
						<name>DISABLE_SINGLE_PULSE</name>											
						<description>Disable single pulse generation.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE_SINGLE_PULSE</name>											
						<description>Enable single pulse generation.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SELECT</name>													
				<description>Select input. Values 0x2 to 0xF are reserved.</description>													
				<bitRange>[7:4]</bitRange>													
																	
				<enumeratedValues>													
				<name>ENUM</name>													
																	
					<enumeratedValue>												
						<name>CTOUT_8_OR_T2_MAT0</name>											
						<description>CTOUT_8 or T2_MAT0</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>T2_MAT0</name>											
						<description>T2_MAT0</description>											
						<value>0x1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
																	
												
			</field>														
		</fields>															
	</register>																
																	
																	
</registers>																	
													

</peripheral>



		<peripheral>
			<name>DAC</name>
			<description>Digital-to-Analog Converter (DAC) </description>
			<groupName>DAC</groupName>
			<baseAddress>0x400E1000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DAC</name>
				<value>0</value>

			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<description>DAC register. Holds the conversion data.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[5:0]</bitRange>
							
						</field>
						<field>
							<name>VALUE</name>
							<description>After the selected settling time after this field is written with a new VALUE, the voltage on the DACOUT pin (with respect to VSSA) is VALUE/1024 X VDDA.</description>
							<bitRange>[15:6]</bitRange>
							
						</field>
						<field>
							<name>BIAS</name>
							<description>Settling time</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SHORT</name>
									<description>The settling time of the DAC is 1 micros max, and the maximum current is 700 microA.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LONG</name>
									<description>The settling time of the DAC is 2.5 micros and the maximum current is 350 microA.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:17]</bitRange>
							
