alibaba/AliOS-Things/components/service/ai/uai/3rdparty/cmsis_nn/CMSIS_5/CMSIS/Pack/Example/SVD/LPC18xx.svd
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>DAC control register.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INT_DMA_REQ</name>
							<description>DMA request</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLR</name>
									<description>This bit is cleared on any write to the DACR register.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>This bit is set by hardware when the timer times out.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBLBUF_ENA</name>
							<description>DMA double-buffering</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>DACR double-buffering is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>When this bit and the CNT_ENA bit are both set, the double-buffering feature in the DACR register will be enabled. Writes to the DACR register are written to a pre-buffer and then transferred to the DACR on the next time-out of the counter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_ENA</name>
							<description>DMA time-out</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Time-out counter operation is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Time-out counter operation is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA_ENA</name>
							<description>DMA enable</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>DMA access is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>DMA Burst Request Input 15 is enabled for the DAC (see Table 136).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CNTVAL</name>
					<description>DAC counter value register.</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VALUE</name>
							<description>16-bit reload value for the DAC interrupt/DMA timer.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="C_CAN1">
			<name>C_CAN0</name>
			<baseAddress>0x400E2000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>C_CAN0</name>
				<value>51</value>
			</interrupt>

		</peripheral>

		<peripheral>
			<name>ADC0</name>
			<description>10-bit Analog-to-Digital Converter (ADC) </description>
			<groupName>ADC</groupName>
			<baseAddress>0x400E3000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC0</name>
				<value>17</value>

			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<description>A/D Control Register. The AD0CR register must be written to select the operating mode before A/D conversion can occur.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Selects which of the ADC[7:0] pins are to be sampled and converted. Bit 0 selects Pin ADC0, bit 1 selects pin AD1,..., and bit 7 selects pin ADC7. In software-controlled mode, only one of these bits should be 1. In hardware scan mode, any value containing 1 to 8 ones. All zeroes is equivalent to 0x01.</description>
							<bitRange>[7:0]</bitRange>
							
						</field>
						<field>
							<name>CLKDIV</name>
							<description>The ADC clock is divided by the CLKDIV value plus one to produce the clock for the A/D converter, which should be less than or equal to 4.5 MHz. Typically, software should program the smallest value in this field that yields a clock of 4.5 MHz or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
							<bitRange>[15:8]</bitRange>
							
						</field>
						<field>
							<name>BURST</name>
							<description>Burst mode</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SOFTWARE</name>
									<description>Conversions are software controlled and require 11 clocks.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BURST</name>
									<description>The AD converter does repeated conversions at the rate selected by the CLKS field, scanning (if necessary) through the pins selected by 1s in the SEL field. The first conversion after the start corresponds to the least-significant 1 in the SEL field, then higher numbered 1 bits (pins) if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion that is  in progress when this bit is cleared will be completed. Important: START bits must be 000 when BURST = 1 or conversions will not start.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKS</name>
							<description>This field selects the number of clocks used for each conversion in Burst mode, and the number of bits of accuracy of the result in the LS bits of ADDR, between 11 clocks (10 bits) and 4 clocks (3 bits).</description>
							<bitRange>[19:17]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>11_CLOCKS_10_BITS</name>
									<description>11 clocks / 10 bits</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_CLOCKS_9_BITS</name>
									<description>10 clocks / 9 bits</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9_CLOCKS_8_BITS</name>
									<description>9 clocks / 8 bits</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_CLOCKS_7_BITS</name>
									<description>8 clocks / 7 bits</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7_CLOCKS_6_BITS</name>
									<description>7 clocks / 6 bits</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6_CLOCKS_5_BITS</name>
									<description>6 clocks / 5 bits</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_CLOCKS_4_BITS</name>
									<description>5 clocks / 4 bits</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_CLOCKS_3_BITS</name>
									<description>4 clocks / 3 bits</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[20:20]</bitRange>
							
